{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyP65ECvm6WjfgJebPRE8Dtk"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"},"accelerator":"GPU","gpuClass":"standard"},"cells":[{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"EtDYsHTBNG4t","executionInfo":{"status":"ok","timestamp":1680291635685,"user_tz":240,"elapsed":20698,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"ce108f7c-290c-4dee-ba2f-5e5a73db4e13"},"outputs":[{"output_type":"stream","name":"stdout","text":["Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/\n","Requirement already satisfied: transformers in /usr/local/lib/python3.9/dist-packages (4.27.4)\n","Requirement already satisfied: packaging>=20.0 in /usr/local/lib/python3.9/dist-packages (from transformers) (23.0)\n","Requirement already satisfied: regex!=2019.12.17 in /usr/local/lib/python3.9/dist-packages (from transformers) (2022.10.31)\n","Requirement already satisfied: tqdm>=4.27 in /usr/local/lib/python3.9/dist-packages (from transformers) (4.65.0)\n","Requirement already satisfied: requests in /usr/local/lib/python3.9/dist-packages (from transformers) (2.27.1)\n","Requirement already satisfied: tokenizers!=0.11.3,<0.14,>=0.11.1 in /usr/local/lib/python3.9/dist-packages (from transformers) (0.13.2)\n","Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.9/dist-packages (from transformers) (1.22.4)\n","Requirement already satisfied: huggingface-hub<1.0,>=0.11.0 in /usr/local/lib/python3.9/dist-packages (from transformers) (0.13.3)\n","Requirement already satisfied: filelock in /usr/local/lib/python3.9/dist-packages (from transformers) (3.10.7)\n","Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.9/dist-packages (from transformers) (6.0)\n","Requirement already satisfied: typing-extensions>=3.7.4.3 in /usr/local/lib/python3.9/dist-packages (from huggingface-hub<1.0,>=0.11.0->transformers) (4.5.0)\n","Requirement already satisfied: urllib3<1.27,>=1.21.1 in /usr/local/lib/python3.9/dist-packages (from requests->transformers) (1.26.15)\n","Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.9/dist-packages (from requests->transformers) (3.4)\n","Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.9/dist-packages (from requests->transformers) (2022.12.7)\n","Requirement already satisfied: charset-normalizer~=2.0.0 in /usr/local/lib/python3.9/dist-packages (from requests->transformers) (2.0.12)\n"]}],"source":["!pip install transformers\n","from transformers import AutoTokenizer, AutoModelForSeq2SeqLM, DataCollatorForSeq2Seq, Seq2SeqTrainingArguments, Seq2SeqTrainer\n","import torch\n","import numpy as np\n","from torch.utils.data import Dataset"]},{"cell_type":"code","source":[],"metadata":{"id":"jXZQP9uE2ocr","executionInfo":{"status":"ok","timestamp":1680291720352,"user_tz":240,"elapsed":14,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":2,"outputs":[]},{"cell_type":"code","source":["import sys\n","from google.colab import drive\n","drive.mount('/content/drive')\n","sys.path.append('/content/drive/My Drive/5180-project')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"g93YcPYZ3sLa","executionInfo":{"status":"ok","timestamp":1680291721499,"user_tz":240,"elapsed":1159,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"e329242e-a388-4d5f-8ee3-4d2d25f76552"},"execution_count":3,"outputs":[{"output_type":"stream","name":"stdout","text":["Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount(\"/content/drive\", force_remount=True).\n"]}]},{"cell_type":"code","source":["import json\n","  \n","# Opening JSON file\n","f = open('/content/drive/My Drive/5180-project/train.json')\n","  \n","# returns JSON object as \n","# a dictionary\n","data = json.load(f)\n","  \n","# Iterating through the json\n","# list\n","# for i in data:\n","#     print(i)\n","  \n","# # Closing file\n","# f.close()"],"metadata":{"id":"dggJG9PQ58lG","executionInfo":{"status":"ok","timestamp":1680291721499,"user_tz":240,"elapsed":3,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":4,"outputs":[]},{"cell_type":"code","source":["data"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"9gmfVBGRK9oG","executionInfo":{"status":"ok","timestamp":1680291721706,"user_tz":240,"elapsed":210,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"a8b4a5d9-a68b-47e8-b354-6203e118e0f4"},"execution_count":5,"outputs":[{"output_type":"execute_result","data":{"text/plain":["[{'question': \"Who are the individuals who have held the title 'Minister for Magic'?\",\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:title hp:Minister_for_magic. }'},\n"," {'question': 'What is the blood status of Cornelius Fudge and Pius Thicknesse?',\n","  'SPARQL': 'SELECT ?individual ?blood WHERE { ?individual a hp:Individual_ ; hp:blood ?blood . FILTER (?individual IN (hp:Cornelius_fudge, hp:Pius_thicknesse)) }'},\n"," {'question': 'Who are the members of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?member WHERE { hp:Edgecombe_family hp:members ?member .}'},\n"," {'question': 'Who are the enemies of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?enemy WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy .}'},\n"," {'question': 'What is the location of London and who are its residents?',\n","  'SPARQL': 'SELECT ?location ?resident WHERE { hp:London hp:location ?location . OPTIONAL {?location hp:residents ?resident .}}'},\n"," {'question': 'Which individuals have a boggart that transforms into Tom Riddle?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:boggart hp:Tom_riddle . }'},\n"," {'question': 'Which organisations are affiliated with the Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?organisation WHERE { ?organisation hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry . FILTER (?organisation != hp:Hogwarts_school_of_witchcraft_and_wizardry)}'},\n"," {'question': 'What is the boggart of Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?boggart WHERE { hp:Cornelius_fudge hp:boggart ?boggart .}'},\n"," {'question': 'What is the blood status of Pius Thicknesse?',\n","  'SPARQL': 'SELECT ?blood WHERE { hp:Pius_thicknesse hp:blood ?blood .}'},\n"," {'question': 'Where is the location of Whitehall?',\n","  'SPARQL': 'SELECT ?location WHERE { hp:Whitehall hp:location ?location .}'},\n"," {'question': \"Who is the wife of Marietta Edgecombe's father?\",\n","  'SPARQL': 'SELECT ?wife WHERE { hp:Marietta_edgecombes_father hp:wife ?wife .}'},\n"," {'question': 'Which individuals have loyalty to both the British Ministry of Magic and Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'Who are the residents of London?',\n","  'SPARQL': 'SELECT ?resident WHERE { hp:London hp:residents ?resident . }'},\n"," {'question': 'What is the job of Millicent Bagnold?',\n","  'SPARQL': 'SELECT ?job WHERE { hp:Millicent_bagnold hp:job ?job .}'},\n"," {'question': 'Who are the male individuals that have served as Minister for Magic?',\n","  'SPARQL': 'SELECT ?individualName WHERE { ?individual hp:gender hp:Male ; hp:job hp:Minister_for_magic ; hp:name ?individualName .}'},\n"," {'question': 'What is the gender of Hector Fawley?',\n","  'SPARQL': 'SELECT ?gender WHERE { hp:Hector_fawley hp:gender ?gender ; hp:name hp:Hector_fawley .}'},\n"," {'question': 'Which individuals have the loyalty of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?individualName WHERE { hp:Edgecombe_family hp:loyalty ?loyalty ; hp:name hp:Edgecombe_family . ?individual hp:loyalty ?loyalty ; hp:name ?individualName .}'},\n"," {'question': 'What is the species of Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?species WHERE { hp:Gellert_grindelwald hp:species ?species ; hp:name hp:Gellert_grindelwald .}'},\n"," {'question': 'Who is the leader of the Ministry of Magic?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:Ministry_of_magic hp:leader ?leader .}'},\n"," {'question': 'What is the location of Whitehall?',\n","  'SPARQL': 'SELECT ?location WHERE { hp:Whitehall hp:location ?location . }'},\n"," {'question': 'What is the job of Hermione Granger?',\n","  'SPARQL': 'SELECT ?job WHERE { hp:Hermione_granger hp:job ?job . }'},\n"," {'question': 'What is the status of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?status WHERE { hp:Edgecombe_family hp:status ?status . } '},\n"," {'question': 'Who are the members of the Edgecombe family who attended Hogwarts School of Witchcraft and Wizardry and were sorted into Ravenclaw?',\n","  'SPARQL': 'SELECT DISTINCT ?memberName WHERE { hp:Edgecombe_family hp:members ?member . ?member hp:house hp:Ravenclaw ; hp:name ?memberName . }'},\n"," {'question': 'What are the names of all individuals who are affiliated with the British Ministry of Magic, are enemies of Gellert Grindelwald, and have served as Minister for Magic?',\n","  'SPARQL': 'SELECT DISTINCT ?ministerName WHERE { ?minister hp:affiliation hp:British_ministry_of_magic ; hp:name ?ministerName . ?icw hp:enemies hp:Gellert_grindelwald . FILTER NOT EXISTS { ?minister hp:loyalty ?loyalty . FILTER (?loyalty != hp:British_ministry_of_magic)} FILTER NOT EXISTS { ?minister hp:enemies hp:Gellert_grindelwald . }}'},\n"," {'question': 'What is the blood status and boggart of Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?bloodStatus ?boggart WHERE { hp:Cornelius_fudge hp:blood ?bloodStatus ; hp:boggart ?boggart . }'},\n"," {'question': 'Who are the known members of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?member WHERE { hp:Edgecombe_family hp:members ?member .}'},\n"," {'question': 'Which organisations is Marietta Edgecombe loyal to?',\n","  'SPARQL': 'SELECT ?loyalty WHERE { hp:Edgecombe_family hp:loyalty ?loyalty . OPTIONAL { ?member hp:loyalty ?loyalty . FILTER(?member IN (hp:Marietta_edgecombe, hp:Marietta_edgecombes_father, hp:Marietta_edgecombes_mother))}}'},\n"," {'question': 'What is the gender and blood status of Pius Thicknesse?',\n","  'SPARQL': 'SELECT ?gender ?bloodStatus WHERE { hp:Pius_thicknesse hp:gender ?gender ; hp:blood ?bloodStatus .}'},\n"," {'question': 'What is the job title of Hermione Granger and which organisations is she loyal to?',\n","  'SPARQL': 'SELECT ?jobTitle ?loyalty WHERE { hp:Hermione_granger hp:title ?jobTitle ; hp:loyalty ?loyalty . }'},\n"," {'question': 'Who is Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?individual WHERE { hp:Cornelius_fudge rdf:type hp:Individual_ . ?individual rdf:type hp:Individual_ . FILTER(?individual = hp:Cornelius_fudge)}'},\n"," {'question': 'What is the nationality of Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?nationality WHERE { hp:Cornelius_fudge hp:nationality ?nationality . }'},\n"," {'question': 'Who are the ministers for magic that have the same title as Hector Fawley?',\n","  'SPARQL': 'SELECT ?minister WHERE { hp:Hector_fawley hp:title ?title . ?minister hp:title ?title . FILTER(?minister != hp:Hector_fawley) }'},\n"," {'question': 'Who has Tom Riddle as a boggart?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:boggart hp:Tom_riddle . }'},\n"," {'question': 'What is the affiliation of the Ministry of Magic and who is its leader?',\n","  'SPARQL': 'SELECT ?affiliation ?leader WHERE { hp:Ministry_of_magic hp:affiliation ?affiliation . hp:Ministry_of_magic hp:leader ?leader .}'},\n"," {'question': 'Who are the members of the Edgecombe family and what is their house?',\n","  'SPARQL': 'SELECT ?member ?house WHERE { hp:Edgecombe_family hp:members ?member . ?member hp:house ?house .}'},\n"," {'question': 'Who was the Minister for Magic before Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?minister WHERE { ?minister hp:title hp:Minister_for_magic ; hp:job hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic ; hp:species hp:Human . FILTER (?minister != hp:Cornelius_fudge)}'},\n"," {'question': 'Which individuals have served as Minister for Magic and are associated with Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?minister WHERE { ?minister hp:title hp:Minister_for_magic ; hp:job hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:species hp:Human .}'},\n"," {'question': 'Who is/was a member of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?member WHERE { hp:Edgecombe_family hp:members ?member .}'},\n"," {'question': 'What is the location of the Whitehall building?',\n","  'SPARQL': 'SELECT ?location WHERE { hp:Whitehall hp:location ?location . }'},\n"," {'question': 'Which organizations are enemies of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?enemy WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy .}'},\n"," {'question': 'What is the name of the organization associated with Hermione Granger?',\n","  'SPARQL': 'SELECT ?organization WHERE { hp:Hermione_granger hp:loyalty ?organization . FILTER (?organization != hp:British_ministry_of_magic)}'},\n"," {'question': \"What is Cornelius Fudge's gender?\",\n","  'SPARQL': 'SELECT ?gender WHERE { hp:Cornelius_fudge hp:gender ?gender . }'},\n"," {'question': 'What are the names and blood statuses of all the individuals who have been Ministers for Magic?',\n","  'SPARQL': 'SELECT ?name ?blood_status WHERE { ?minister a hp:Individual_ ; hp:title hp:Minister_for_magic ; hp:name ?name ; hp:blood ?blood_status . }'},\n"," {'question': 'Which organisations have affiliations with both the British Ministry of Magic and Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?org_name WHERE { ?org a hp:Organisation_ ; hp:affiliation hp:British_ministry_of_magic ; hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name ?org_name .}'},\n"," {'question': 'Which individuals have the same blood status as Pius Thicknesse and are affiliated with either the British Ministry of Magic or the Death Eaters?',\n","  'SPARQL': 'SELECT ?name WHERE { ?individual a hp:Individual_ ; hp:blood ?blood_status ; hp:loyalty hp:British_ministry_of_magic, hp:Death_eaters ; hp:name ?name . { SELECT ?blood_status WHERE { hp:Pius_thicknesse hp:blood ?blood_status .}}}'},\n"," {'question': 'What are the blood statuses of individuals who have been Minister for Magic?',\n","  'SPARQL': 'SELECT ?name ?blood WHERE { ?person hp:title hp:Minister_for_magic ; hp:name ?name ; hp:blood ?blood . }'},\n"," {'question': 'What is the blood status and house of Marietta Edgecombe?',\n","  'SPARQL': 'SELECT ?blood ?house WHERE { hp:Marietta_edgecombe hp:blood ?blood ; hp:house ?house . }'},\n"," {'question': 'Who are the individuals who have loyalty to both the British Ministry of Magic and Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?name WHERE { ?person hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name ?name .}'},\n"," {'question': 'Who are the individuals who have loyalty to the British Ministry of Magic and are also associated with the Death Eaters?',\n","  'SPARQL': 'SELECT ?name WHERE { ?person hp:loyalty hp:British_ministry_of_magic, hp:Death_eaters ; hp:name ?name .}'},\n"," {'question': 'Who were the individuals who were loyal to both the British Ministry of Magic and Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?individualName  WHERE { ?individual hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry . ?individual hp:name ?individualName .}'},\n"," {'question': 'Who were the enemies of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?enemyName  WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy . ?enemy hp:name ?enemyName .}'},\n"," {'question': 'Who were the individuals who had the job of Minister for Magic and were Half-blood or Pure-blood?',\n","  'SPARQL': 'SELECT ?individualName WHERE { ?individual hp:job hp:Minister_for_magic . ?individual hp:blood hp:Half_blood, hp:Pure_blood . ?individual hp:name ?individualName . }'},\n"," {'question': 'Who were the individuals who had a Non-corporeal patronus?',\n","  'SPARQL': 'SELECT ?individualName WHERE { ?individual hp:patronus hp:Non_corporeal . ?individual hp:name ?individualName . }'},\n"," {'question': 'Who were the individuals who were born in Great Britain and had the job of Minister for Magic?',\n","  'SPARQL': 'SELECT ?individualName WHERE { ?individual hp:born hp:Great_britain . ?individual hp:job hp:Minister_for_magic . ?individual hp:name ?individualName . }'},\n"," {'question': 'Who were the individuals who had Tom Riddle as their boggart?',\n","  'SPARQL': 'SELECT ?individualName WHERE { ?individual hp:boggart hp:Tom_riddle . ?individual hp:name ?individualName .}'},\n"," {'question': 'What are the names of all individuals who have served as Minister for Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { ?minister hp:title hp:Minister_for_magic . ?minister hp:name ?name . }'},\n"," {'question': \"Which individual's boggart is Tom Riddle?\",\n","  'SPARQL': 'SELECT ?name WHERE { ?individual hp:boggart hp:Tom_riddle . ?individual hp:name ?name . }'},\n"," {'question': 'Who are the individuals that belong to the Edgecombe family?',\n","  'SPARQL': 'SELECT ?member WHERE { hp:Edgecombe_family hp:members ?member .}'},\n"," {'question': 'What are the names of all the enemies of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy . ?enemy hp:name ?name . }'},\n"," {'question': 'Who are the individuals that have served as Minister for Magic and are affiliated with Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?name WHERE { ?minister hp:title hp:Minister_for_magic . ?minister hp:name ?name . ?minister hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'What are the genders of individuals who are affiliated with the British Ministry of Magic?',\n","  'SPARQL': 'SELECT DISTINCT ?gender WHERE { ?individual hp:loyalty hp:British_ministry_of_magic . ?individual hp:gender ?gender . }'},\n"," {'question': 'Who are the individuals that have served as Minister for Magic and have a non-corporeal patronus?',\n","  'SPARQL': 'SELECT ?name WHERE { ?minister hp:title hp:Minister_for_magic . ?minister hp:patronus hp:Non_corporeal . ?minister hp:name ?name . }'},\n"," {'question': 'Who are the members of the Edgecombe family and what is their status?',\n","  'SPARQL': 'SELECT ?name ?member ?status WHERE { hp:Edgecombe_family hp:name ?name ; hp:members ?member ; hp:status ?status .}'},\n"," {'question': 'What is the job of Cornelius Fudge and what is his boggart?',\n","  'SPARQL': 'SELECT ?job ?boggart WHERE { hp:Cornelius_fudge hp:job ?job ; hp:boggart ?boggart .}'},\n"," {'question': 'What is the location of Whitehall and who are its affiliations?',\n","  'SPARQL': 'SELECT ?name ?location ?affiliation WHERE { hp:Whitehall hp:name ?name ; hp:location ?location ; hp:affiliation ?affiliation .}'},\n"," {'question': \"Which organizations have the enemies 'Death Eaters', 'Order of the Phoenix', and 'Tom Riddle'?\",\n","  'SPARQL': 'SELECT ?orgName WHERE { ?org a hp:Organisation_ ; hp:name ?orgName ; hp:enemies hp:Death_eaters, hp:Order_of_the_phoenix, hp:Tom_riddle .}'},\n"," {'question': \"What are the headquarters of the organizations with the intention of 'reverting the consequences of major magical mishaps'?\",\n","  'SPARQL': 'SELECT ?orgName ?headquarters WHERE { ?org a hp:Organisation_ ; hp:name ?orgName ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps ; hp:headquarters ?headquarters .}'},\n"," {'question': 'Who were the male advisors to the Minister for Magic?',\n","  'SPARQL': 'SELECT ?advisor WHERE { ?advisor hp:gender hp:Male . ?advisor hp:job hp:Advisor_to_the_minister_for_magic .}'},\n"," {'question': 'What are the affiliations and intentions of the Department of Magical Accidents and Catastrophes?',\n","  'SPARQL': 'SELECT ?affiliation ?intention WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:affiliation ?affiliation . hp:Department_of_magical_accidents_and_catastrophes hp:intentions ?intention .}'},\n"," {'question': 'Who are the individuals with the loyalty to the British Ministry of Magic, the Order of the Phoenix, and Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:loyalty hp:British_ministry_of_magic . ?individual hp:loyalty hp:Order_of_the_phoenix . ?individual hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'Which organisations have enemies in common with the Department of Magical Accidents and Catastrophes?',\n","  'SPARQL': 'SELECT DISTINCT ?org1 ?org2 WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:enemies ?enemy . ?org1 hp:enemies ?enemy . ?org2 hp:enemies ?enemy . FILTER(?org1 != ?org2) }'},\n"," {'question': 'Who are the individuals with the title of Chief Warlock and their gender?',\n","  'SPARQL': 'SELECT ?name ?gender WHERE { ?individual hp:job hp:Chief_warlock ; hp:title hp:Chief_warlock . ?individual hp:name ?name . ?individual hp:gender ?gender .}'},\n"," {'question': \"What are the locations of the Minister for Magic's office and the British Ministry of Magic headquarters?\",\n","  'SPARQL': 'SELECT ?office_location ?headquarters_location WHERE { hp:Minister_for_magics_office hp:location ?office_location . hp:British_ministry_of_magic_headquarters hp:location ?headquarters_location .}'},\n"," {'question': 'Who are the half-bloods?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:blood hp:Half_blood .}'},\n"," {'question': 'What are the names of the organisations with the colour codes #9966cc and #C9a0dc?',\n","  'SPARQL': 'SELECT ?name WHERE { ?org hp:bgcolor hp:9966cc, hp:C9a0dc . ?org hp:name ?name . }'},\n"," {'question': \"Who are the individuals with Hermione Granger's job and title?\",\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:job hp:Department_of_magical_law_enforcement, hp:Minister_for_magic . ?individual hp:title hp:Department_of_magical_law_enforcement, hp:Minister_for_magic . }'},\n"," {'question': 'What is the affiliation of the Educational Office organization?',\n","  'SPARQL': 'SELECT ?affiliation WHERE {hp:Educational_office hp:affiliation ?affiliation .}'},\n"," {'question': 'What is the source URL for the Pure-blood page?',\n","  'SPARQL': 'SELECT ?source_url WHERE {hp:Pure_blood hp:source_url ?source_url .}'},\n"," {'question': 'What is the name of the organization that deals with magical accidents and catastrophes?',\n","  'SPARQL': 'SELECT ?name WHERE {?org a hp:Organisation_ ; hp:name ?name ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps .}'},\n"," {'question': 'Who is the Chief Warlock of the Wizengamot in 1544?',\n","  'SPARQL': 'SELECT ?name WHERE {hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?name .}'},\n"," {'question': 'What is the affiliation of the Improper Use of Magic Office organization?',\n","  'SPARQL': 'SELECT ?affiliation WHERE {hp:Improper_use_of_magic_office hp:affiliation ?affiliation .}'},\n"," {'question': 'What is the name of the wand that belongs to Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?name WHERE {hp:Cornelius_fudges_wand hp:name ?name .}'},\n"," {'question': 'What is the name of the organization that oversees the wizarding schools?',\n","  'SPARQL': 'SELECT ?name WHERE {hp:Educational_office hp:name ?name .}'},\n"," {'question': \"What is the name of the organization that the Minister for Magic's office is affiliated with?\",\n","  'SPARQL': 'SELECT ?affiliation WHERE { hp:Minister_for_magics_office hp:affiliation ?affiliation .}'},\n"," {'question': 'What is the name of the organization led by the International Confederation of Wizards and affiliated with Wizardkind?',\n","  'SPARQL': 'SELECT ?organizationName WHERE { hp:Educational_office hp:name ?organizationName ; hp:leader hp:International_confederation_of_wizards ; hp:affiliation hp:Wizardkind .}'},\n"," {'question': 'Which organization is dedicated to reverting the consequences of major magical mishaps and headquartered in the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?organizationName WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name ?organizationName ; hp:headquarters hp:British_ministry_of_magic ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps .}'},\n"," {'question': 'Who is the current Minister for Magic and what is the name of their office?',\n","  'SPARQL': 'SELECT ?ministerName ?officeName WHERE { hp:Minister_for_magics_office hp:name ?officeName . ?minister hp:job hp:Minister_for_magic ; hp:name ?ministerName .}'},\n"," {'question': 'Which organization is responsible for reversing the consequences of major magical mishaps?',\n","  'SPARQL': 'SELECT ?orgName  WHERE {  hp:Department_of_magical_accidents_and_catastrophes hp:name ?orgName ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps .}'},\n"," {'question': 'Who was the Chief Warlock of the Wizengamot in 1544?',\n","  'SPARQL': 'SELECT ?chief_warlock_name WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?chief_warlock_name .}'},\n"," {'question': \"Who owned Cornelius Fudge's wand?\",\n","  'SPARQL': 'SELECT ?wand_owner WHERE { hp:Cornelius_fudges_wand hp:owners ?wand_owner .}'},\n"," {'question': 'Which Hogwarts house does Hermione Granger belong to?',\n","  'SPARQL': 'SELECT ?hogwarts_house WHERE { hp:Hermione_granger hp:house ?hogwarts_house .}'},\n"," {'question': 'Which organizations are enemies of the Improper Use of Magic Office?',\n","  'SPARQL': 'SELECT ?enemy_organization WHERE { hp:Improper_use_of_magic_office hp:enemies ?enemy_organization .}'},\n"," {'question': 'What is the intention of the Department of Magical Accidents and Catastrophes?',\n","  'SPARQL': 'SELECT ?intention WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:intentions ?intention .}'},\n"," {'question': 'What is the loyalty of Peeves?',\n","  'SPARQL': 'SELECT ?loyalty WHERE { hp:Peeves hp:loyalty ?loyalty .}'},\n"," {'question': 'What is the name of the office of the head of the British Ministry of Magic and where is it located?',\n","  'SPARQL': 'SELECT ?name ?location WHERE { hp:Minister_for_magics_office hp:name ?name ; hp:location ?location .}'},\n"," {'question': 'Which organizations are affiliated with the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?name WHERE { ?organization hp:name ?name ; hp:affiliation hp:International_confederation_of_wizards .}'},\n"," {'question': 'What is the job of Hermione Granger and what are her loyalties?',\n","  'SPARQL': 'SELECT ?job ?loyalty WHERE { hp:Hermione_granger hp:job ?job ; hp:loyalty ?loyalty .}'},\n"," {'question': 'What is the wand made by Cornelius Fudge in 1993?',\n","  'SPARQL': 'SELECT ?wand_name WHERE { hp:Cornelius_fudges_wand hp:name ?wand_name .}'},\n"," {'question': 'Who are the individuals associated with the Hufflepuff house?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:house hp:Hufflepuff .}'},\n"," {'question': 'What Hogwarts house does Hermione Granger belong to and what is her current job title?',\n","  'SPARQL': 'SELECT ?house ?job WHERE { hp:Hermione_granger hp:house ?house ; hp:title ?job .}'},\n"," {'question': 'Which organization has the most enemies?',\n","  'SPARQL': 'SELECT ?org (COUNT(?enemy) AS ?enemyCount) WHERE { ?org hp:enemies ?enemy . } GROUP BY ?org ORDER BY DESC(?enemyCount) LIMIT 1'},\n"," {'question': 'Which Hogwarts house has the most individuals affiliated with it and what are their names?',\n","  'SPARQL': 'SELECT ?house (GROUP_CONCAT(?name; separator=\", \") AS ?names) WHERE { ?individual hp:house ?house ; hp:name ?name . } GROUP BY ?house ORDER BY DESC(COUNT(?individual)) LIMIT 1'},\n"," {'question': 'Which organizations have the intention of reverting the consequences of major magical mishaps and are enemies of both the Death Eaters and the Order of the Phoenix?',\n","  'SPARQL': 'SELECT ?organization WHERE { ?organization hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps . ?organization hp:enemies hp:Death_eaters, hp:Order_of_the_phoenix .}'},\n"," {'question': 'Who are the individuals who have held the job of Minister for Magic and were also members of Gryffindor house at Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:job hp:Minister_for_magic . ?individual hp:house hp:Gryffindor . }'},\n"," {'question': 'Who is the chief warlock of the Wizengamot and what is their gender?',\n","  'SPARQL': 'SELECT ?name ?gender WHERE { ?chief_warlock hp:name ?name ; hp:gender ?gender ; hp:job hp:Chief_warlock, hp:Wizengamot .}'},\n"," {'question': 'What are the names of all the Hogwarts houses?',\n","  'SPARQL': 'SELECT ?name WHERE { ?house hp:name ?name . FILTER regex(str(?house), \"Hogwarts\") }'},\n"," {'question': 'What are the names of all the organisations affiliated with the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { ?org hp:affiliation hp:British_ministry_of_magic ; hp:name ?name . }'},\n"," {'question': 'Who are the individuals who have loyalty to the Order of the Phoenix?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:loyalty hp:Order_of_the_phoenix ; a hp:Individual_ .}'},\n"," {'question': 'What organizations have been enemies of the Department of Magical Accidents and Catastrophes?',\n","  'SPARQL': 'SELECT ?enemy WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:enemies ?enemy . }'},\n"," {'question': 'What individuals are affiliated with Hogwarts School of Witchcraft and Wizardry and have been awarded the Order of Merlin?',\n","  'SPARQL': 'SELECT ?individual WHERE { ?individual hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry, hp:Order_of_merlin . }'},\n"," {'question': 'Who is the Chief Warlock of the Wizengamot in 1544 and what is his job?',\n","  'SPARQL': 'SELECT ?name ?job WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?name . hp:Chief_warlock_of_the_wizengamot_in_1544 hp:job ?job . }'},\n"," {'question': 'What organizations is Hermione Granger loyal to?',\n","  'SPARQL': 'SELECT ?loyalty WHERE { hp:Hermione_granger hp:loyalty ?loyalty . }'},\n"," {'question': 'Who are the enemies of the Department of Magical Accidents and Catastrophes?',\n","  'SPARQL': 'SELECT ?enemies WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:enemies ?enemies . }'},\n"," {'question': 'Which organizations did Hermione Granger belong to, and what positions did she hold in those organizations?',\n","  'SPARQL': 'SELECT ?organization ?position WHERE { hp:Hermione_granger hp:job ?position . ?organization hp:leader hp:Hermione_granger . FILTER(?organization != hp:Hermione_granger) }'},\n"," {'question': 'Which organizations had enemies in common, and what were those enemies?',\n","  'SPARQL': 'SELECT DISTINCT ?org1 ?org2 ?enemy WHERE { ?org1 hp:enemies ?enemy . ?org2 hp:enemies ?enemy . FILTER(?org1 != ?org2) }'},\n"," {'question': 'Which organizations had headquarters located at the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?organization WHERE { ?organization hp:headquarters hp:British_ministry_of_magic . }'},\n"," {'question': 'What are the names of the individuals who are both members of the Order of the Phoenix and loyal to Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?name WHERE { ?person hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry, hp:Order_of_the_phoenix ; hp:name ?name . ?person a hp:Individual_ . }'},\n"," {'question': 'What is the name of the individual who was Chief Warlock of the Wizengamot in 1544 and what is their gender?',\n","  'SPARQL': 'SELECT ?name ?gender WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?name ; hp:gender ?gender . hp:Chief_warlock_of_the_wizengamot_in_1544 a hp:Individual_ . }'},\n"," {'question': 'What is the name of the wand that belonged to Cornelius Fudge and who were its masters?',\n","  'SPARQL': 'SELECT ?wandName ?masters WHERE { hp:Cornelius_fudges_wand hp:name ?wandName ; hp:masters ?masters . }'},\n"," {'question': 'What are the names of the individuals who have the loyalty to the British Ministry of Magic and the Gryffindor house?',\n","  'SPARQL': 'SELECT ?name WHERE { ?person hp:loyalty hp:British_ministry_of_magic, hp:Gryffindor ; hp:name ?name . ?person a hp:Individual_ . }'},\n"," {'question': 'What is the affiliation of the Astronomy Tower?',\n","  'SPARQL': 'SELECT ?affiliation WHERE { hp:Astronomy_tower hp:affiliation ?affiliation . }'},\n"," {'question': 'Who is the leader of the Wizengamot?',\n","  'SPARQL': 'SELECT ?leaderName WHERE { hp:Wizengamot hp:leader hp:Albus_dumbledore . hp:Albus_dumbledore hp:name ?leaderName . }'},\n"," {'question': 'What is the name of the organization founded by Harry Potter in 1997?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Dumbledores_army hp:founder hp:Harry_potter . hp:Dumbledores_army hp:founded hp:1997 . hp:Dumbledores_army hp:name ?name . }'},\n"," {'question': 'Who are the enemies of the Wizengamot?',\n","  'SPARQL': 'SELECT ?enemyName WHERE { hp:Wizengamot hp:enemies ?enemy . ?enemy hp:name ?enemyName . }'},\n"," {'question': \"Who owns Albus Dumbledore's wand?\",\n","  'SPARQL': 'SELECT ?ownerName WHERE { hp:Albus_dumbledores_wand hp:owners ?owner . ?owner hp:name ?ownerName . }'},\n"," {'question': \"Who is Albus Dumbledore's romance?\",\n","  'SPARQL': 'SELECT ?romanceName WHERE { hp:Gellert_grindelwald hp:romances hp:Albus_dumbledore . hp:Gellert_grindelwald hp:name ?romanceName . }'},\n"," {'question': 'Who is the professor of Defence Against the Dark Arts?',\n","  'SPARQL': 'SELECT ?professorName WHERE { hp:Defence_against_the_dark_arts hp:professor ?professor . ?professor hp:name ?professorName . }'},\n"," {'question': 'What is the distinction of Phoenix?',\n","  'SPARQL': 'SELECT ?distinction WHERE { hp:Phoenix hp:distinction ?distinction . }'},\n"," {'question': 'What is the name of the tower located at Hogwarts School of Witchcraft and Wizardry that is affiliated with the school?',\n","  'SPARQL': 'SELECT ?towerName WHERE { hp:Astronomy_tower hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry . hp:Astronomy_tower hp:name ?towerName . }'},\n"," {'question': 'Who are the residents of Mould-on-the-wold?',\n","  'SPARQL': 'SELECT ?residentName WHERE { hp:Mould_on_the_wold hp:residents ?resident . ?resident hp:name ?residentName . }'},\n"," {'question': 'Who is the prefect that is affiliated with Gryffindor and is the leader of the Head Boy or Girl?',\n","  'SPARQL': 'SELECT ?prefectName WHERE { hp:Prefect hp:affiliation hp:Gryffindor . hp:Prefect hp:leader hp:Head_boy_or_girl . hp:Prefect hp:name ?prefectName . }'},\n"," {'question': 'Who subscribed to the Transfiguration Today newsletter?',\n","  'SPARQL': 'SELECT ?subscriberName WHERE { hp:Transfiguration_today hp:subscribers ?subscriber . ?subscriber hp:name ?subscriberName . }'},\n"," {'question': 'What is the name of the organization founded in 1997 by Harry Potter with the intention of teaching Defence Against the Dark Arts?',\n","  'SPARQL': 'SELECT ?organizationName WHERE { hp:Dumbledores_army hp:founded hp:1997 . hp:Dumbledores_army hp:founder hp:Harry_potter . hp:Dumbledores_army hp:intentions hp:Defence_against_the_dark_arts . hp:Dumbledores_army hp:name ?organizationName . }'},\n"," {'question': 'Who is the leader of the Wizengamot and who are its enemies?',\n","  'SPARQL': 'SELECT ?leaderName ?enemyName WHERE { hp:Wizengamot hp:leader ?leader . ?leader hp:name ?leaderName . hp:Wizengamot hp:enemies ?enemy . ?enemy hp:name ?enemyName . }'},\n"," {'question': 'What is the location of Mould on the Wold and who are its residents?',\n","  'SPARQL': 'SELECT ?location ?residents WHERE { hp:Mould_on_the_wold hp:location ?location . hp:Mould_on_the_wold hp:residents ?residents . }'},\n"," {'question': 'Who is the leader of the Wizengamot and what is its affiliation and enemies?',\n","  'SPARQL': 'SELECT ?leader ?affiliation ?enemies WHERE { hp:Wizengamot hp:leader ?leader . hp:Wizengamot hp:affiliation ?affiliation . hp:Wizengamot hp:enemies ?enemies . }'},\n"," {'question': \"What are the intentions of Dumbledore's Army and who founded it?\",\n","  'SPARQL': 'SELECT ?intentions ?founder WHERE { hp:Dumbledores_army hp:intentions ?intentions . hp:Dumbledores_army hp:founder ?founder . }'},\n"," {'question': 'Who is the romances of Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?romances WHERE { hp:Gellert_grindelwald hp:romances ?romances . }'},\n"," {'question': 'What is the job of Harry Potter and what are his loyalties?',\n","  'SPARQL': 'SELECT ?job ?loyalty WHERE { hp:Harry_potter hp:job ?job . hp:Harry_potter hp:loyalty ?loyalty . }'},\n"," {'question': 'Who was the leader of the Wizengamot and what is their affiliation?',\n","  'SPARQL': 'SELECT ?leader ?affiliation  WHERE { hp:Wizengamot hp:leader ?leader . hp:Wizengamot hp:affiliation ?affiliation . }'},\n"," {'question': 'What is the name of the location where the Mould_on_the_wold is located?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Mould_on_the_wold hp:name ?name . }'},\n"," {'question': 'Who owns the Elder wand?',\n","  'SPARQL': 'SELECT ?owners  WHERE { hp:Elder_wand hp:owners ?owners . }'},\n"," {'question': \"Who founded Dumbledore's Army and what were their intentions?\",\n","  'SPARQL': 'SELECT ?founder ?intentions  WHERE { hp:Dumbledores_army hp:founder ?founder . hp:Dumbledores_army hp:intentions ?intentions . }'},\n"," {'question': 'What is the name of the person who romanced Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?romances  WHERE { hp:Gellert_grindelwald hp:romances ?romances . }'},\n"," {'question': 'Where is the Hogwarts castle located?',\n","  'SPARQL': 'SELECT ?location  WHERE { hp:Hogwarts_castle hp:location ?location . }'},\n"," {'question': 'Who are the residents of Mould_on_the_wold?',\n","  'SPARQL': 'SELECT ?residents  WHERE { hp:Mould_on_the_wold hp:residents ?residents . }'},\n"," {'question': 'What is the name of the organization whose headquarters is at the British Ministry of Magic and who are their enemies?',\n","  'SPARQL': 'SELECT ?name ?enemies  WHERE { hp:Wizengamot hp:name ?name . hp:Wizengamot hp:enemies ?enemies . hp:Wizengamot hp:headquarters hp:British_ministry_of_magic . }'},\n"," {'question': \"What is the name of the individual who has Albus Dumbledore's wand?\",\n","  'SPARQL': 'SELECT ?name  WHERE { hp:Albus_dumbledores_wand hp:owners ?owners . ?owners hp:name ?name . }'},\n"," {'question': 'What is the name of the Hogwarts location in Great Britain with an affiliation to the Astronomy Tower?',\n","  'SPARQL': 'SELECT ?name  WHERE { hp:Astronomy_tower hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry . hp:Astronomy_tower hp:location hp:Great_britain . hp:Astronomy_tower hp:name ?name . }'},\n"," {'question': 'Who is the leader of the Wizengamot and also the enemy of the Order of the Phoenix?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:Wizengamot hp:leader ?leader . hp:Wizengamot hp:enemies hp:Order_of_the_phoenix . }'},\n"," {'question': 'Which individuals have owned the Elder Wand?',\n","  'SPARQL': 'SELECT ?owner WHERE { hp:Elder_wand hp:owners ?owner . }'},\n"," {'question': 'Who are the residents of Mould on the Wold?',\n","  'SPARQL': 'SELECT ?resident WHERE { hp:Mould_on_the_wold hp:residents ?resident . }'},\n"," {'question': 'What is the name of the organization with the name Council of Magical Law and an affiliation to the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Council_of_magical_law hp:name ?name . hp:Council_of_magical_law hp:affiliation hp:British_ministry_of_magic . }'},\n"," {'question': 'What is the name of the organization with the intention of Defence against the Dark Arts and a headquarters at Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Defence_against_the_dark_arts hp:name ?name . hp:Dumbledores_army hp:intentions hp:Defence_against_the_dark_arts . hp:Dumbledores_army hp:headquarters hp:Hogwarts_school_of_witchcraft_and_wizardry . }'},\n"," {'question': 'Who has a romances relationship with Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?romances WHERE { hp:Gellert_grindelwald hp:romances ?romances . }'},\n"," {'question': 'Who is the leader of Wizengamot?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:Wizengamot hp:leader ?leader . }'},\n"," {'question': 'What is the affiliation of the Highlands location?',\n","  'SPARQL': 'SELECT ?residents WHERE { hp:Mould_on_the_wold hp:residents ?residents . }'},\n"," {'question': \"Who is the founder of Dumbledore's Army?\",\n","  'SPARQL': 'SELECT ?founder WHERE { hp:Dumbledores_army hp:founder ?founder . }'},\n"," {'question': 'What is the job of Harry Potter?',\n","  'SPARQL': 'SELECT ?job WHERE { hp:Harry_potter hp:job ?job . }'},\n"," {'question': 'Who is the romantic interest of Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?romances WHERE { hp:Gellert_grindelwald hp:romances ?romances . }'},\n"," {'question': 'What is the affiliation of Hogwarts Castle?',\n","  'SPARQL': 'SELECT ?affiliation WHERE { hp:Hogwarts_castle hp:affiliation ?affiliation . }'},\n"," {'question': 'What is the name of the location where the Astronomy tower is located?',\n","  'SPARQL': 'SELECT ?locationName WHERE { hp:Astronomy_tower hp:location ?location . ?location hp:name ?locationName . }'},\n"," {'question': 'Who was Gellert Grindelwald romantically involved with?',\n","  'SPARQL': 'SELECT ?romanceName WHERE { hp:Gellert_grindelwald hp:romances ?romance . ?romance hp:name ?romanceName . }'},\n"," {'question': 'What is the name of the person who has owned the Elder wand?',\n","  'SPARQL': 'SELECT ?ownerName WHERE { hp:Elder_wand hp:owners ?owner . ?owner hp:name ?ownerName . }'},\n"," {'question': 'What is the location of the Hogwarts castle?',\n","  'SPARQL': 'SELECT ?locationName WHERE { hp:Hogwarts_castle hp:location ?location . ?location hp:name ?locationName . }'},\n"," {'question': 'What is the name of the group whose location is in England and has residents from the Dumbledore family?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Mould_on_the_wold hp:location hp:England ; hp:residents hp:Dumbledore_family ; hp:name ?name . }'},\n"," {'question': \"Who is the founder and leader of Dumbledore's Army?\",\n","  'SPARQL': 'SELECT ?founder ?leader WHERE { hp:Dumbledores_army hp:founder ?founder ; hp:leader ?leader . }'},\n"," {'question': 'What is the name and affiliation of the group whose enemies include the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name ?affiliation WHERE { hp:Dumbledores_army hp:enemies hp:British_ministry_of_magic ; hp:name ?name ; hp:affiliation ?affiliation . } '},\n"," {'question': 'Which Hogwarts professor taught Defence Against the Dark Arts?',\n","  'SPARQL': 'SELECT ?professor WHERE { hp:Defence_against_the_dark_arts hp:professor ?professor . }'},\n"," {'question': 'Who has owned the Elder Wand?',\n","  'SPARQL': 'SELECT ?owner WHERE { hp:Elder_wand hp:owners ?owner . }'},\n"," {'question': 'Who did Gellert Grindelwald have a romantic relationship with?',\n","  'SPARQL': 'SELECT ?romances WHERE { hp:Gellert_grindelwald hp:romances ?romances . }'},\n"," {'question': 'Where is the Astronomy Tower located?',\n","  'SPARQL': 'SELECT ?location WHERE { hp:Astronomy_tower hp:location ?location . }'},\n"," {'question': 'Who is the current Supreme Mugwump of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:International_confederation_of_wizards hp:leader ?leader . }'},\n"," {'question': 'What is the name of the group affiliated with Hogwarts School of Witchcraft and Wizardry whose headquarters is also at Hogwarts?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Prefect hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:headquarters hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name ?name . }'},\n"," {'question': 'Who is the owner of Hogwarts Castle?',\n","  'SPARQL': 'SELECT ?owner WHERE { hp:Hogwarts_castle hp:owner ?owner . }'},\n"," {'question': \"What are the intentions of Dumbledore's Army?\",\n","  'SPARQL': 'SELECT ?intentions WHERE { hp:Dumbledores_army hp:intentions ?intentions . }'},\n"," {'question': 'What is the blood status of Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?blood WHERE { hp:Gellert_grindelwald hp:blood ?blood . }'},\n"," {'question': 'Who are the romances of Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?romances WHERE { hp:Gellert_grindelwald hp:romances ?romances . }'},\n"," {'question': 'What is the affiliation of the Hogwarts Castle?',\n","  'SPARQL': 'SELECT ?affiliation WHERE { hp:Hogwarts_castle hp:affiliation ?affiliation . }'},\n"," {'question': 'What is the name of the location where Astronomy Tower is situated?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Astronomy_tower hp:location ?location . ?location hp:name ?name . }'},\n"," {'question': 'Who are the subscribers of Transfiguration Today?',\n","  'SPARQL': 'SELECT ?subscribers WHERE { hp:Transfiguration_today hp:subscribers ?subscribers . }'},\n"," {'question': 'What are the affiliations of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?affiliation WHERE { hp:Edgecombe_family hp:loyalty ?affiliation .}'},\n"," {'question': \"What is the gender of Gellert Grindelwald and Marietta Edgecombe's father?\",\n","  'SPARQL': 'SELECT ?grindelwaldGender ?edgecombeFatherGender WHERE { hp:Gellert_grindelwald hp:gender ?grindelwaldGender . hp:Marietta_edgecombes_father hp:gender ?edgecombeFatherGender .}'},\n"," {'question': 'Who are the individuals that have served as the Minister for Magic?',\n","  'SPARQL': 'SELECT ?minister_name WHERE { ?minister hp:job hp:Minister_for_magic ; hp:name ?minister_name .}'},\n"," {'question': 'What is the blood status of the members of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?blood_status WHERE { hp:Edgecombe_family hp:members ?edgecombe_member ; hp:blood ?blood_status .}'},\n"," {'question': 'What is the name and gender of the father of Marietta Edgecombe?',\n","  'SPARQL': 'SELECT ?father_name ?gender WHERE { hp:Marietta_edgecombes_father hp:daughter hp:Marietta_edgecombe ; hp:name ?father_name ; hp:gender ?gender .}'},\n"," {'question': 'What is the skin color of Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?skin_color WHERE { hp:Cornelius_fudge hp:skin ?skin_color .}'},\n"," {'question': 'Who are the individuals that have the job title of Minister for Magic and are loyal to both the British Ministry of Magic and Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?minister_name WHERE { ?minister hp:job hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name ?minister_name .}'},\n"," {'question': 'Who are the individuals that have served as the Minister for Magic and are Pure-blood?',\n","  'SPARQL': 'SELECT ?minister_name WHERE { ?minister hp:job hp:Minister_for_magic ; hp:blood hp:Pure_blood ; hp:name ?minister_name .}'},\n"," {'question': 'Who are the individuals who have been a Minister for Magic?',\n","  'SPARQL': 'SELECT ?ministerName WHERE { ?minister a hp:Individual_ . ?minister hp:title hp:Minister_for_magic . ?minister hp:name ?ministerName .}'},\n"," {'question': 'What is the name and blood status of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?familyName ?bloodStatus WHERE { hp:Edgecombe_family hp:name ?familyName . hp:Edgecombe_family hp:blood ?bloodStatus .}'},\n"," {'question': 'What is the name and blood status of the Minister for Magic who is afraid of Tom Riddle?',\n","  'SPARQL': 'SELECT ?name ?blood_status WHERE { ?minister a hp:Individual_ ; hp:name ?name ; hp:blood ?blood_status ; hp:job hp:Minister_for_magic ; hp:boggart hp:Tom_riddle .}'},\n"," {'question': 'What is the name and blood status of the Minister for Magic who was born in Great Britain and is loyal to both the British Ministry of Magic and Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?name ?blood_status WHERE { ?minister a hp:Individual_ ; hp:name ?name ; hp:blood ?blood_status ; hp:job hp:Minister_for_magic ; hp:born hp:Great_britain ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'What are the names of the members of the Edgecombe family who are affiliated with Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?member_name WHERE { hp:Edgecombe_family hp:members ?member . ?member hp:name ?member_name ; hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'What are the names of the individuals and organisations that are enemies of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?enemy_name WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy . ?enemy hp:name ?enemy_name .}'},\n"," {'question': 'What is the full name of Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?full_name WHERE { hp:Cornelius_fudge hp:name ?full_name.}'},\n"," {'question': 'Who are the individuals who served as Minister for Magic?',\n","  'SPARQL': 'SELECT ?minister_name WHERE { ?minister a hp:Individual_ ; hp:title hp:Minister_for_magic ; hp:name ?minister_name .}'},\n"," {'question': 'Where is Whitehall located?',\n","  'SPARQL': 'SELECT ?location WHERE { hp:Whitehall hp:location ?location.}'},\n"," {'question': 'What is the gender of Gellert Grindelwald?',\n","  'SPARQL': 'SELECT ?gender WHERE { hp:Gellert_grindelwald hp:gender ?gender.}'},\n"," {'question': 'Who are the male ministers for magic in the Harry Potter series?',\n","  'SPARQL': 'SELECT ?minister WHERE { ?minister hp:gender hp:Male ; hp:job hp:Minister_for_magic .}'},\n"," {'question': 'What is the location of London in the Harry Potter series?',\n","  'SPARQL': 'SELECT ?location WHERE { hp:London hp:location ?location .}'},\n"," {'question': 'Who are the members of the Edgecombe family in the Harry Potter series?',\n","  'SPARQL': 'SELECT ?member WHERE { hp:Edgecombe_family hp:members ?member .}'},\n"," {'question': 'What is the blood status of Gellert Grindelwald in the Harry Potter series?',\n","  'SPARQL': 'SELECT ?blood_status WHERE { hp:Gellert_grindelwald hp:blood ?blood_status .}'},\n"," {'question': 'Who are the individuals that held the position of Minister for Magic?',\n","  'SPARQL': 'SELECT ?individuals WHERE { ?individuals hp:title hp:Minister_for_magic.}'},\n"," {'question': 'What are the houses that the Edgecombe family is affiliated with?',\n","  'SPARQL': 'SELECT ?house WHERE { hp:Edgecombe_family hp:house ?house.}'},\n"," {'question': 'What is the blood status of Hermione Granger?',\n","  'SPARQL': 'SELECT ?blood_status WHERE { hp:Hermione_granger hp:blood ?blood_status.}'},\n"," {'question': \"Who are the daughters of Marietta Edgecombe's father?\",\n","  'SPARQL': 'SELECT ?daughter WHERE { hp:Marietta_edgecombes_father hp:daughter ?daughter.}'},\n"," {'question': 'What is the job of Hector Fawley?',\n","  'SPARQL': 'SELECT ?fawleyJob WHERE { hp:Hector_fawley hp:job ?fawleyJob .}'},\n"," {'question': 'What is the blood status and house of the Edgecombe family?',\n","  'SPARQL': 'SELECT ?bloodStatus ?house WHERE { hp:Edgecombe_family hp:blood ?bloodStatus . hp:Edgecombe_family hp:house ?house .}'},\n"," {'question': 'What are the enemies of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?enemy WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy .}'},\n"," {'question': 'What is the name of the father of Marietta Edgecombe?',\n","  'SPARQL': 'SELECT ?fatherName WHERE { hp:Marietta_edgecombes_father hp:name ?fatherName .}'},\n"," {'question': 'Who are the members of the Edgecombe family who are also affiliated with Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?member WHERE { hp:Edgecombe_family hp:members ?member ; hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'What is the blood status of Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?blood WHERE { hp:Cornelius_fudge hp:blood ?blood .}'},\n"," {'question': 'Who are the individuals who are enemies of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?enemy WHERE { hp:International_confederation_of_wizards hp:enemies ?enemy .}'},\n"," {'question': \"Who is the Minister for Magic with the job title 'Minister for Magic' and the loyalty to both the British Ministry of Magic and Hogwarts School of Witchcraft and Wizardry?\",\n","  'SPARQL': 'SELECT ?minister WHERE { ?minister hp:job hp:Minister_for_magic ; hp:title hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'What is the name of the Minister for Magic who was a Half-blood and Pure-blood, and had Tom Riddle as their Boggart?',\n","  'SPARQL': 'SELECT ?minister_name WHERE { ?minister hp:blood hp:Half_blood, hp:Pure_blood ; hp:boggart hp:Tom_riddle ; hp:title hp:Minister_for_magic ; hp:name ?minister_name .}'},\n"," {'question': 'What are the names of the members of the Edgecombe family who are listed in the knowledge graph?',\n","  'SPARQL': 'SELECT ?member_name WHERE { hp:Edgecombe_family hp:members ?member . ?member hp:name ?member_name .}'},\n"," {'question': 'What is the name and affiliation of the Minister for Magic?',\n","  'SPARQL': 'SELECT ?name ?affiliation WHERE { hp:Minister_for_magics_office hp:name ?name . hp:Minister_for_magics_office hp:affiliation ?affiliation .}'},\n"," {'question': 'What are the names of the individuals affiliated with Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?name WHERE { ?individual hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry . ?individual hp:name ?name .}'},\n"," {'question': 'What are the names of the individuals affiliated with the Order of the Phoenix?',\n","  'SPARQL': 'SELECT ?name WHERE { ?individual hp:loyalty hp:Order_of_the_phoenix . ?individual hp:name ?name .}'},\n"," {'question': 'What are the names of the individuals affiliated with the Department of Magical Law Enforcement?',\n","  'SPARQL': 'SELECT ?name WHERE { ?individual hp:job hp:Department_of_magical_law_enforcement . ?individual hp:name ?name .}'},\n"," {'question': 'What are the names of the individuals affiliated with the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { ?individual hp:affiliation hp:British_ministry_of_magic . ?individual hp:name ?name .}'},\n"," {'question': 'What is the name of the organization responsible for dealing with major magical accidents and catastrophes in the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name ?name .}'},\n"," {'question': 'What is the name of the individual who was the Chief Warlock of the Wizengamot in 1544?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?name .}'},\n"," {'question': 'What is the name of the organization that deals with improper use of magic in the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Improper_use_of_magic_office hp:name ?name .}'},\n"," {'question': \"What is the name of the individual who owns Cornelius Fudge's wand?\",\n","  'SPARQL': 'SELECT ?owner WHERE { hp:Cornelius_fudges_wand hp:owners ?owner .}'},\n"," {'question': \"What is the location of the Minister for Magic's office in the British Ministry of Magic?\",\n","  'SPARQL': 'SELECT ?location WHERE { hp:Minister_for_magics_office hp:location ?location .}'},\n"," {'question': 'What is the name of the organization that Hermione Granger works for?',\n","  'SPARQL': 'SELECT ?organizationName WHERE { hp:Hermione_granger hp:job ?jobTitle. ?jobTitle hp:name ?organizationName .}'},\n"," {'question': 'What is the name of the individual who held the job title of Chief Warlock of the Wizengamot in 1544?',\n","  'SPARQL': 'SELECT ?individualName WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?individualName.}'},\n"," {'question': 'What is the name of the organization responsible for dealing with magical accidents and catastrophes?',\n","  'SPARQL': 'SELECT ?organizationName WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name ?organizationName.}'},\n"," {'question': 'What is the source URL for the page about Pure-bloods?',\n","  'SPARQL': 'SELECT ?sourceUrl WHERE { hp:Pure_blood hp:source_url ?sourceUrl.}'},\n"," {'question': 'What is the name of the organization responsible for dealing with improper use of magic?',\n","  'SPARQL': 'SELECT ?organizationName WHERE { hp:Improper_use_of_magic_office hp:name ?organizationName.}'},\n"," {'question': 'What is the blood status of Queenie Goldstein?',\n","  'SPARQL': 'SELECT ?bloodStatus WHERE { hp:Queenie_goldstein hp:blood ?bloodStatus.}'},\n"," {'question': 'What is the name of the individual who is Peeves loyal to?',\n","  'SPARQL': 'SELECT ?individualName WHERE { hp:Peeves hp:loyalty ?loyaltyTo. ?loyaltyTo hp:name ?individualName.}'},\n"," {'question': 'What is the source URL for the page about the Order of Merlin?',\n","  'SPARQL': 'SELECT ?sourceUrl WHERE { hp:Order_of_merlin hp:source_url ?sourceUrl.}'},\n"," {'question': 'What is the name of the educational office affiliated with the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Educational_office hp:name ?name ; hp:affiliation hp:International_confederation_of_wizards .}'},\n"," {'question': 'What is the name of the organization responsible for dealing with improper use of magic in the Harry Potter universe?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Improper_use_of_magic_office hp:name ?name .}'},\n"," {'question': 'Who is the leader of the International Confederation of Wizards Educational Office?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:Educational_office hp:leader ?leader .}'},\n"," {'question': 'What is the source URL for the article on the Stylish Wizard of the Year award?',\n","  'SPARQL': 'SELECT ?source_url WHERE { hp:Stylish_wizard_of_the_year hp:source_url ?source_url .}'},\n"," {'question': \"What is the location of the Minister for Magic's office?\",\n","  'SPARQL': 'SELECT ?location WHERE { hp:Minister_for_magics_office hp:location ?location .}'},\n"," {'question': 'What is the color of the Department of Magical Accidents and Catastrophes in the Harry Potter universe?',\n","  'SPARQL': 'SELECT ?bgcolor WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:bgcolor ?bgcolor .}'},\n"," {'question': \"Who is the nephew of Cornelius Fudge's wife?\",\n","  'SPARQL': 'SELECT ?nephew WHERE { hp:Cornelius_fudges_wife hp:nephew ?nephew .}'},\n"," {'question': 'What is the source URL for the article on the Order of Merlin in the Harry Potter universe?',\n","  'SPARQL': 'SELECT ?source_url WHERE { hp:Order_of_merlin hp:source_url ?source_url .}'},\n"," {'question': 'What is the name of the Hogwarts house known for its wit and intelligence?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Ravenclaw hp:name ?name .}'},\n"," {'question': 'What is the name and affiliation of the educational office in the wizarding world?',\n","  'SPARQL': 'SELECT ?name ?affiliation WHERE { hp:Educational_office hp:name ?name . hp:Educational_office hp:affiliation ?affiliation .}'},\n"," {'question': 'What is the color of the background of the Department of Magical Accidents and Catastrophes, and what are its intentions?',\n","  'SPARQL': 'SELECT ?bgcolor ?intentions WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:bgcolor ?bgcolor . hp:Department_of_magical_accidents_and_catastrophes hp:intentions ?intentions .}'},\n"," {'question': 'What is the blood status of Queenie Goldstein, and what is her species?',\n","  'SPARQL': 'SELECT ?blood_status ?species WHERE { hp:Queenie_goldstein hp:blood ?blood_status . hp:Queenie_goldstein hp:species ?species .}'},\n"," {'question': 'What is the name of the individual who served as the chief warlock of the Wizengamot in 1544?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?name .}'},\n"," {'question': 'What is the name of the organization responsible for reverting the consequences of major magical mishaps? Give the SPARQL query to retrieve the answer.',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name ?name .}'},\n"," {'question': 'What is the name of the organization responsible for handling magical accidents and catastrophes, and where is their headquarters located?',\n","  'SPARQL': 'SELECT ?name ?headquarters WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name ?name ; hp:headquarters ?headquarters .}'},\n"," {'question': 'What is the name of the wand owned by Cornelius Fudge and who made it?',\n","  'SPARQL': 'SELECT ?name ?madeBy WHERE { hp:Cornelius_fudges_wand hp:name ?name ; hp:made ?madeBy .}'},\n"," {'question': 'What is the name of the organization responsible for handling improper use of magic, and who are their enemies?',\n","  'SPARQL': 'SELECT ?name ?enemies WHERE { hp:Improper_use_of_magic_office hp:name ?name ; hp:enemies ?enemies .}'},\n"," {'question': 'Who is the chief warlock of the Wizengamot in 1544 and what is their gender?',\n","  'SPARQL': 'SELECT ?name ?gender WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?name ; hp:gender ?gender .}'},\n"," {'question': 'What is the name of the educational office that is affiliated with the International Confederation of Wizards and Wizardkind?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Educational_office hp:name ?name ; hp:affiliation hp:International_confederation_of_wizards, hp:Wizardkind .}'},\n"," {'question': 'What is the name of the wand owned by Cornelius Fudge?',\n","  'SPARQL': 'SELECT ?wand_name WHERE {hp:Cornelius_fudges_wand hp:name ?wand_name .}'},\n"," {'question': 'What is the affiliation of the Department of Magical Accidents and Catastrophes?',\n","  'SPARQL': 'SELECT ?affiliation WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:affiliation ?affiliation .}'},\n"," {'question': 'What is the gender of Peeves?',\n","  'SPARQL': 'SELECT ?gender WHERE { hp:Peeves hp:gender ?gender .}'},\n"," {'question': 'What is the name of the organization responsible for magical accidents and catastrophes, and what are their intentions?',\n","  'SPARQL': 'SELECT ?name ?intentions WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name ?name ;hp:intentions ?intentions .}'},\n"," {'question': 'Who was the Chief Warlock of the Wizengamot in 1544, and what is their job title?',\n","  'SPARQL': 'SELECT ?name ?job_title WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name ?name ; hp:title ?job_title .}'},\n"," {'question': \"What is the name of Cornelius Fudge's wand and when was it made?\",\n","  'SPARQL': 'SELECT ?name ?made WHERE { hp:Cornelius_fudges_wand hp:name ?name ;hp:made ?made .}'},\n"," {'question': \"What is the location and affiliation of the Minister for Magic's office?\",\n","  'SPARQL': 'SELECT ?location ?affiliation WHERE { hp:Minister_for_magics_office hp:location ?location ; hp:affiliation ?affiliation .}          '},\n"," {'question': 'What is the name of the wizarding organization responsible for dealing with improper use of magic, and who are their enemies?',\n","  'SPARQL': 'SELECT ?name ?enemies WHERE { hp:Improper_use_of_magic_office hp:name ?name ; hp:enemies ?enemies .}'},\n"," {'question': 'What is the name of the organization responsible for education, who do they lead, and what affiliations do they have?',\n","  'SPARQL': 'SELECT ?name ?leader ?affiliation WHERE { hp:Educational_office hp:name ?name ; hp:leader ?leader ; hp:affiliation ?affiliation .}'},\n"," {'question': 'What is the name and species of Queenie Goldstein?',\n","  'SPARQL': 'SELECT ?name ?species WHERE { hp:Queenie_goldstein hp:name ?name ; hp:species ?species .}'},\n"," {'question': 'What is the source URL for the Order of Merlin and for the Advisor to the Minister for Magic?',\n","  'SPARQL': 'SELECT ?order_source ?advisor_source WHERE { hp:Order_of_merlin hp:source_url ?order_source . hp:Advisor_to_the_minister_for_magic hp:source_url ?advisor_source .}'},\n"," {'question': 'What is the affiliation and location of the British Ministry of Magic headquarters?',\n","  'SPARQL': 'SELECT ?affiliation ?location WHERE { hp:British_ministry_of_magic_headquarters hp:affiliation ?affiliation . hp:British_ministry_of_magic_headquarters hp:location ?location .}'},\n"," {'question': \"What is the source URL for information about Cornelius Fudge's wand?\",\n","  'SPARQL': 'SELECT ?source_url WHERE { hp:Cornelius_fudges_wand hp:source_url ?source_url .}'},\n"," {'question': 'What is the name of the office held by Hermione Granger?',\n","  'SPARQL': 'SELECT ?office_name WHERE { hp:Hermione_granger hp:title ?title . ?title hp:name ?office_name .}'},\n"," {'question': 'Who is Queenie Goldstein and what is her blood status?',\n","  'SPARQL': 'SELECT ?name ?blood_status WHERE { hp:Queenie_goldstein hp:name ?name ; hp:blood ?blood_status .}'},\n"," {'question': 'What is the name of the Hogwarts house associated with the eagle?',\n","  'SPARQL': 'SELECT ?house_name WHERE { hp:Ravenclaw hp:name ?house_name .}'},\n"," {'question': 'What is the source URL for information about the Order of Merlin?',\n","  'SPARQL': 'SELECT ?source_url WHERE { hp:Order_of_merlin hp:source_url ?source_url .}'},\n"," {'question': 'What is the name of the organization led by Albus Dumbledore that is enemies with the Order of the Phoenix and headquartered in the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Wizengamot hp:leader hp:Albus_dumbledore ; hp:enemies hp:Order_of_the_phoenix ; hp:headquarters hp:British_ministry_of_magic ; hp:name ?name .}'},\n"," {'question': 'What is the name of the location where the Council of Magical Law is located?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Council_of_magical_law hp:name ?name ; hp:affiliation hp:British_ministry_of_magic .}'},\n"," {'question': 'Who are the enemies of the Wizengamot and what is its headquarters?',\n","  'SPARQL': 'SELECT ?enemy ?headquarters WHERE { hp:Wizengamot hp:enemies ?enemy ; hp:headquarters ?headquarters .} '},\n"," {'question': 'Who is the professor of Defence Against the Dark Arts at Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?professor WHERE { hp:Defence_against_the_dark_arts hp:professor ?professor .}'},\n"," {'question': 'Who are the owners of the Elder Wand?',\n","  'SPARQL': 'SELECT ?owner WHERE { hp:Elder_wand hp:owners ?owner .}'},\n"," {'question': 'What is the affiliation of the Phoenix and what is its distinction?',\n","  'SPARQL': 'SELECT ?affiliation ?distinction WHERE { hp:Phoenix hp:affiliation ?affiliation ; hp:distinction ?distinction .}'},\n"," {'question': \"Who founded Dumbledore's Army and what is its intention?\",\n","  'SPARQL': 'SELECT ?founder ?intention WHERE { hp:Dumbledores_army hp:founder ?founder ; hp:intentions ?intention .}'},\n"," {'question': \"What is the name of the individual who has the wand named 'Albus Dumbledore's Wand'?\",\n","  'SPARQL': 'SELECT ?name WHERE { hp:Albus_dumbledores_wand hp:owners ?owner . ?owner hp:name ?name .}'},\n"," {'question': 'What is the name of the location affiliated with Mould on the Wold?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Mould_on_the_wold hp:location ?location . ?location hp:name ?name .}'},\n"," {'question': 'What is the location of the Astronomy Tower?',\n","  'SPARQL': 'SELECT ?locationName WHERE { hp:Astronomy_tower hp:location ?location . ?location hp:name ?locationName .}'},\n"," {'question': 'What is the name of the council of magical law affiliated with the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Council_of_magical_law hp:affiliation hp:British_ministry_of_magic ; hp:name ?name .}'},\n"," {'question': 'Who are the residents of Mould-on-the-Wold?',\n","  'SPARQL': 'SELECT ?residents WHERE { hp:Mould_on_the_wold hp:residents ?residents .}'},\n"," {'question': 'What is the affiliation of the Phoenix?',\n","  'SPARQL': 'SELECT ?affiliation WHERE { hp:Phoenix hp:affiliation ?affiliation .}'},\n"," {'question': 'Who is the Supreme Mugwump and leader of the International Confederation of Wizards?',\n","  'SPARQL': \"SELECT ?leader WHERE { hp:International_confederation_of_wizards hp:leader ?leader . FILTER (CONTAINS(str(?leader), 'Supreme_mugwump'))}\"},\n"," {'question': 'Who is the head boy or girl of the prefects?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:Prefect hp:leader hp:Head_boy_or_girl ; hp:name ?leader .}'},\n"," {'question': 'What is the name of the council that oversees magical laws in Great Britain?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Council_of_magical_law hp:name ?name .}'},\n"," {'question': 'What is the name of the location where the Mould-on-the-wold is situated?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Mould_on_the_wold hp:name ?name .}'},\n"," {'question': 'What are the locations affiliated with Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?location WHERE { hp:Hogwarts_school_of_witchcraft_and_wizardry hp:location ?location .}'},\n"," {'question': 'Who are the subscribers to Transfiguration Today?',\n","  'SPARQL': 'SELECT ?subscribers WHERE { hp:Transfiguration_today hp:subscribers ?subscribers .}'},\n"," {'question': 'Who is the Supreme Mugwump of the International Confederation of Wizards?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:International_confederation_of_wizards hp:leader ?leader .}'},\n"," {'question': \"Who are the founders of Dumbledore's Army?\",\n","  'SPARQL': 'SELECT ?founder WHERE { hp:Dumbledores_army hp:founder ?founder .}'},\n"," {'question': 'What are the names of the characters in the Harry Potter universe who are Half-Bloods?',\n","  'SPARQL': 'SELECT ?character_name WHERE { ?character a hp:Individual_; hp:name ?character_name ; hp:blood hp:Half_blood .}'},\n"," {'question': 'What is the location of the Hogwarts Castle?',\n","  'SPARQL': 'SELECT ?location_name WHERE { hp:Hogwarts_castle hp:location ?location ; hp:name ?location_name . FILTER (strstarts(str(?location), str(hp:Great_britain)))}'},\n"," {'question': 'Who is the owner of the Elder Wand?',\n","  'SPARQL': 'SELECT ?owner_name WHERE { hp:Elder_wand hp:owners ?owner . ?owner hp:name ?owner_name .}'},\n"," {'question': 'What is the name of the organization that has Albus Dumbledore as its leader?',\n","  'SPARQL': 'SELECT ?organization_name WHERE { ?organization hp:leader hp:Albus_dumbledore ; hp:name ?organization_name .}'},\n"," {'question': 'Which individuals in the Harry Potter universe are known to have owned the Elder Wand?',\n","  'SPARQL': 'SELECT ?individual_name WHERE { hp:Elder_wand hp:owners ?owner . ?owner a hp:Individual_ ; hp:name ?individual_name .}'},\n"," {'question': 'Which organizations have Hogwarts School of Witchcraft and Wizardry as their affiliation?',\n","  'SPARQL': 'SELECT ?organization_name WHERE { ?organization hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name ?organization_name .}'},\n"," {'question': 'What is the name of the organization led by Albus Dumbledore that is an enemy of the British Ministry of Magic and has its headquarters at the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Wizengamot hp:leader hp:Albus_dumbledore ; hp:name ?name ; hp:enemies hp:Order_of_the_phoenix .}'},\n"," {'question': 'What is the name of the Hogwarts castle owner?',\n","  'SPARQL': 'SELECT ?ownerName WHERE { hp:Hogwarts_castle hp:owner ?owner . ?owner hp:name ?ownerName .}'},\n"," {'question': 'Who are the owners of the Elder wand?',\n","  'SPARQL': 'SELECT ?ownerName WHERE { hp:Elder_wand hp:owners ?owner . ?owner hp:name ?ownerName .}'},\n"," {'question': 'Which individuals are loyal to Albus Dumbledore?',\n","  'SPARQL': 'SELECT ?individualName WHERE { ?individual hp:loyalty hp:Albus_dumbledore . ?individual hp:name ?individualName .}'},\n"," {'question': 'What is the name of the location where the British Ministry of Magic is headquartered?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Wizengamot hp:name ?name ; hp:headquarters hp:British_ministry_of_magic .}'},\n"," {'question': 'What is the name of the organization founded in 1997 with the intention of learning Defence Against the Dark Arts?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Dumbledores_army hp:name ?name ; hp:founded hp:1997 ; hp:intentions hp:Defence_against_the_dark_arts .}'},\n"," {'question': \"What is the name of the location where Dumbledore's Army is headquartered?\",\n","  'SPARQL': 'SELECT ?locationName WHERE { hp:Dumbledores_army hp:headquarters ?location . ?location hp:name ?locationName .}'},\n"," {'question': 'What is the name of the Hogwarts location in Scotland that is affiliated with Hogwarts School of Witchcraft and Wizardry?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Hogwarts_castle hp:location hp:Scotland ; hp:name ?name ; hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry .}'},\n"," {'question': 'Who is the head boy or girl of the Prefects?',\n","  'SPARQL': 'SELECT ?leader WHERE { hp:Prefect hp:leader hp:Head_boy_or_girl ; hp:name ?leader .}'},\n"," {'question': 'What is the name of the newspaper subscribed to by Albus Dumbledore?',\n","  'SPARQL': 'SELECT ?name WHERE { hp:Transfiguration_today hp:name ?name ; hp:subscribers hp:Albus_dumbledore .}'},\n"," {'question': 'What is the name of the school where the Astronomy tower is located?',\n","  'SPARQL': \"SELECT ?schoolName WHERE { hp:Astronomy_tower hp:location ?location . ?location hp:name ?schoolName . FILTER(CONTAINS(str(?location), 'Hogwarts'))}\"},\n"," {'question': 'What is the name of the council that belongs to the British Ministry of Magic?',\n","  'SPARQL': 'SELECT ?councilName WHERE { hp:Council_of_magical_law hp:affiliation hp:British_ministry_of_magic .hp:Council_of_magical_law hp:name ?councilName .}'},\n"," {'question': 'Which place in Great Britain is the location of Mould on the Wold?',\n","  'SPARQL': \"SELECT ?placeName WHERE { hp:Mould_on_the_wold hp:location ?location . ?location hp:name ?placeName . FILTER(CONTAINS(str(?location), 'Great_britain'))}\"},\n"," {'question': 'What is the name of the wand that belonged to Albus Dumbledore?',\n","  'SPARQL': 'SELECT ?wandName WHERE { hp:Albus_dumbledores_wand hp:name ?wandName .}'}]"]},"metadata":{},"execution_count":5}]},{"cell_type":"code","source":["import numpy as np\n","from sklearn.model_selection import train_test_split"],"metadata":{"id":"omXoKW9N8xqr","executionInfo":{"status":"ok","timestamp":1680291721707,"user_tz":240,"elapsed":3,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":6,"outputs":[]},{"cell_type":"code","source":["# data"],"metadata":{"id":"9s38Suw3BHcx","executionInfo":{"status":"ok","timestamp":1680291721707,"user_tz":240,"elapsed":3,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":7,"outputs":[]},{"cell_type":"code","source":["y = []\n","for i in range(len(data)):\n","  y.append(0)"],"metadata":{"id":"lw3Wm_KG9R49","executionInfo":{"status":"ok","timestamp":1680291721707,"user_tz":240,"elapsed":2,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":8,"outputs":[]},{"cell_type":"code","source":["X_train, X_test, y_train, y_test = train_test_split(data, y, test_size=0.33, random_state=42)"],"metadata":{"id":"Dmqp-5uo89km","executionInfo":{"status":"ok","timestamp":1680291721707,"user_tz":240,"elapsed":2,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":9,"outputs":[]},{"cell_type":"code","source":["class Dataset(Dataset):\n","    \"\"\"   \n","    fun exercise: does it help if the result is asked to be produced in reverse order?\n","    \"\"\"\n","\n","    def __init__(self, data):\n","        self.data = data #data\n","        \n","    def __len__(self):\n","        return len(self.data)\n","\n","    def __getitem__(self, idx):\n","        # given a problem index idx, first recover the associated a + b\n","        # idx = self.ixes[idx]\n","        render = self.data[idx] \n","\n","        return {\"input_ids\":tokenizer(render['question'])[\"input_ids\"], \"labels\":tokenizer(render['SPARQL'])[\"input_ids\"]}"],"metadata":{"id":"IuiLU61u32ES","executionInfo":{"status":"ok","timestamp":1680291721707,"user_tz":240,"elapsed":2,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":10,"outputs":[]},{"cell_type":"code","source":["model_checkpoint = \"/content/drive/My Drive/5180-project/hp_v3.4\"\n","model = AutoModelForSeq2SeqLM.from_pretrained(model_checkpoint,max_length = 1024)\n","tokenizer = AutoTokenizer.from_pretrained(model_checkpoint)\n","# tokenizer([\"0\", \"01\", \"20\"])"],"metadata":{"id":"jv32EC8CC-RJ","executionInfo":{"status":"ok","timestamp":1680297893494,"user_tz":240,"elapsed":4087,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":53,"outputs":[]},{"cell_type":"code","source":["batch_size = 64\n","model_name = model_checkpoint.split(\"/\")[-1]\n","args = Seq2SeqTrainingArguments(\n","    f\"{model_name}-finetuned-xsum\",\n","    evaluation_strategy = \"epoch\",\n","    learning_rate=5e-4,\n","    per_device_train_batch_size=batch_size,\n","    per_device_eval_batch_size=batch_size,\n","    weight_decay=1e-3,\n","    save_total_limit=3,\n","    num_train_epochs=30,\n","    gradient_accumulation_steps = 3,\n","    predict_with_generate=True,\n","    push_to_hub=False,\n",")\n","\n","data_collator = DataCollatorForSeq2Seq(tokenizer, model=model)"],"metadata":{"id":"90wSaQvnDDLQ","executionInfo":{"status":"ok","timestamp":1680297895254,"user_tz":240,"elapsed":152,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}}},"execution_count":54,"outputs":[]},{"cell_type":"code","source":["trainer = Seq2SeqTrainer(\n","    model,\n","    args,\n","    train_dataset=Dataset(X_train),\n","    eval_dataset=Dataset(X_test),\n","    data_collator=data_collator,\n","    tokenizer=tokenizer,\n",")\n","\n","trainer.train()"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":906},"id":"RdjqIDbADV21","executionInfo":{"status":"ok","timestamp":1680298003102,"user_tz":240,"elapsed":99678,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"8afdba73-b707-4dd6-f035-5bc10ff59ef8"},"execution_count":55,"outputs":[{"output_type":"stream","name":"stderr","text":["/usr/local/lib/python3.9/dist-packages/transformers/optimization.py:391: FutureWarning: This implementation of AdamW is deprecated and will be removed in a future version. Use the PyTorch implementation torch.optim.AdamW instead, or set `no_deprecation_warning=True` to disable this warning\n","  warnings.warn(\n","You're using a BartTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.\n"]},{"output_type":"display_data","data":{"text/plain":["<IPython.core.display.HTML object>"],"text/html":["\n","    <div>\n","      \n","      <progress value='30' max='30' style='width:300px; height:20px; vertical-align: middle;'></progress>\n","      [30/30 01:36, Epoch 22/30]\n","    </div>\n","    <table border=\"1\" class=\"dataframe\">\n","  <thead>\n"," <tr style=\"text-align: left;\">\n","      <th>Epoch</th>\n","      <th>Training Loss</th>\n","      <th>Validation Loss</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <td>0</td>\n","      <td>No log</td>\n","      <td>11.768638</td>\n","    </tr>\n","    <tr>\n","      <td>1</td>\n","      <td>No log</td>\n","      <td>8.787288</td>\n","    </tr>\n","    <tr>\n","      <td>3</td>\n","      <td>No log</td>\n","      <td>6.787366</td>\n","    </tr>\n","    <tr>\n","      <td>3</td>\n","      <td>No log</td>\n","      <td>5.390290</td>\n","    </tr>\n","    <tr>\n","      <td>4</td>\n","      <td>No log</td>\n","      <td>4.174825</td>\n","    </tr>\n","    <tr>\n","      <td>6</td>\n","      <td>No log</td>\n","      <td>3.624648</td>\n","    </tr>\n","    <tr>\n","      <td>6</td>\n","      <td>No log</td>\n","      <td>2.877405</td>\n","    </tr>\n","    <tr>\n","      <td>7</td>\n","      <td>No log</td>\n","      <td>2.245879</td>\n","    </tr>\n","    <tr>\n","      <td>9</td>\n","      <td>No log</td>\n","      <td>2.085821</td>\n","    </tr>\n","    <tr>\n","      <td>9</td>\n","      <td>No log</td>\n","      <td>1.873800</td>\n","    </tr>\n","    <tr>\n","      <td>10</td>\n","      <td>No log</td>\n","      <td>1.725378</td>\n","    </tr>\n","    <tr>\n","      <td>12</td>\n","      <td>No log</td>\n","      <td>1.527163</td>\n","    </tr>\n","    <tr>\n","      <td>12</td>\n","      <td>No log</td>\n","      <td>1.471565</td>\n","    </tr>\n","    <tr>\n","      <td>13</td>\n","      <td>No log</td>\n","      <td>1.373319</td>\n","    </tr>\n","    <tr>\n","      <td>15</td>\n","      <td>No log</td>\n","      <td>1.222394</td>\n","    </tr>\n","    <tr>\n","      <td>15</td>\n","      <td>No log</td>\n","      <td>1.209801</td>\n","    </tr>\n","    <tr>\n","      <td>16</td>\n","      <td>No log</td>\n","      <td>1.154109</td>\n","    </tr>\n","    <tr>\n","      <td>18</td>\n","      <td>No log</td>\n","      <td>1.054362</td>\n","    </tr>\n","    <tr>\n","      <td>18</td>\n","      <td>No log</td>\n","      <td>1.023463</td>\n","    </tr>\n","    <tr>\n","      <td>19</td>\n","      <td>No log</td>\n","      <td>0.990705</td>\n","    </tr>\n","    <tr>\n","      <td>21</td>\n","      <td>No log</td>\n","      <td>0.949437</td>\n","    </tr>\n","    <tr>\n","      <td>21</td>\n","      <td>No log</td>\n","      <td>0.933679</td>\n","    </tr>\n","    <tr>\n","      <td>22</td>\n","      <td>No log</td>\n","      <td>0.924614</td>\n","    </tr>\n","  </tbody>\n","</table><p>"]},"metadata":{}},{"output_type":"execute_result","data":{"text/plain":["TrainOutput(global_step=30, training_loss=3.041009775797526, metrics={'train_runtime': 99.3379, 'train_samples_per_second': 63.118, 'train_steps_per_second': 0.302, 'total_flos': 101711067494400.0, 'train_loss': 3.041009775797526, 'epoch': 22.5})"]},"metadata":{},"execution_count":55}]},{"cell_type":"code","source":["test = Dataset(X_test)\n","count = 0\n","for index in range(len(test)):\n","  device = 'cuda'\n","  preds = model.generate(input_ids = torch.tensor(test[index][\"input_ids\"]).to(device).view(1,-1))\n","  print(tokenizer.decode(np.array(preds.cpu()[0]))[7:-4])\n","  print(tokenizer.decode(np.array(test[index][\"labels\"]))[3:-4])\n","  print('------------------------------------------------------')\n","  # print(preds)\n","  # count+=1.0*(tokenizer.decode(np.array(preds.cpu()[0])) == tokenizer.decode(np.array(test[index][\"labels\"])))\n","  # if index%10==0:\n","    # print(tokenizer.decode(np.array(preds.cpu()[0])),tokenizer.decode(np.array(test[index][\"labels\"])))\n","# count/len(test)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"WA5cbpo5NtwB","executionInfo":{"status":"ok","timestamp":1680298044167,"user_tz":240,"elapsed":33694,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"bf53692d-cafc-49e1-d2a6-e9314f190931"},"execution_count":56,"outputs":[{"output_type":"stream","name":"stderr","text":["/usr/local/lib/python3.9/dist-packages/transformers/generation/utils.py:1288: UserWarning: Using `max_length`'s default (1024) to control the generation length. This behaviour is deprecated and will be removed from the config in v5 of Transformers -- we recommend using `max_new_tokens` to control the maximum length of the generation.\n","  warnings.warn(\n"]},{"output_type":"stream","name":"stdout","text":["SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individualName WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?individualName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location WHERE { hp:Whitehall hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?member WHERE { hp:Edgecombe_family hp:members?member.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT DISTINCT?gender WHERE {?individual hp:loyalty hp:British_ministry_of_magic.?individual hp:gender?gender. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?member WHERE { hp:Edgecombe_family hp:members?member.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?job?boggart WHERE { hp:Cornelius_fudge hp:job?job ; hp:boggart?boggart.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?loyalty WHERE { hp:Peeves hp:loyalty?loyalty.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?father_name?gender WHERE { hp:Marietta_edgecombes_father hp:daughter hp:Marietta_edgecombe ; hp:name?father_name ; hp:gender?gender.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?location?affiliation WHERE { hp:Minister_for_magics_office hp:location?location ; hp:affiliation?affiliation.}          \n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?blood?house WHERE { hp:Marietta_edgecombe hp:blood?blood ; hp:house?house. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE {?individual hp:job hp:Department_of_magical_law_enforcement, hp:Minister_for_magic.?individual hp:title hp:Department_of_magical_law_enforcement, hp:Minister_for_magic. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?locationName WHERE { hp:Hogwarts_castle hp:location?location.?location hp:name?locationName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?intentions WHERE { hp:Dumbledores_army hp:intentions?intentions. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?enemy WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:enemies?enemy. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Prefect hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:headquarters hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?character_name WHERE {?character a hp:Individual_; hp:name?character_name ; hp:blood hp:Half_blood.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE {?individual hp:boggart hp:Tom_riddle. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organizationName WHERE { hp:Improper_use_of_magic_office hp:name?organizationName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Mould_on_the_wold hp:location hp:England ; hp:residents hp:Dumbledore_family ; hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual_name WHERE { hp:Elder_wand hp:owners?owner.?owner a hp:Individual_ ; hp:name?individual_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE {?individual hp:blood hp:Half_blood.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?councilName WHERE { hp:Council_of_magical_law hp:affiliation hp:British_ministry_of_magic.hp:Council_of_magical_law hp:name?councilName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?individual hp:loyalty hp:Order_of_the_phoenix.?individual hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?source_url WHERE { hp:Order_of_merlin hp:source_url?source_url.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation WHERE {hp:Educational_office hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romances  WHERE { hp:Gellert_grindelwald hp:romances?romances. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name  WHERE { hp:Astronomy_tower hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry. hp:Astronomy_tower hp:location hp:Great_britain. hp:Astronomy_tower hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation?leader WHERE { hp:Ministry_of_magic hp:affiliation?affiliation. hp:Ministry_of_magic hp:leader?leader.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?founder?intention WHERE { hp:Dumbledores_army hp:founder?founder ; hp:intentions?intention.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?founder WHERE { hp:Dumbledores_army hp:founder?founder.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?location WHERE { hp:Minister_for_magics_office hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemy WHERE { hp:International_confederation_of_wizards hp:enemies?enemy.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {hp:Educational_office hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Mould_on_the_wold hp:name?name.}\n","------------------------------------------------------\n","SELECT?name?name WHERE { hp:Cornelius_fudges_wand hp:job?name.}\n","SELECT?name?enemies WHERE { hp:Improper_use_of_magic_office hp:name?name ; hp:enemies?enemies.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location WHERE { hp:Whitehall hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?blood WHERE {?person hp:title hp:Minister_for_magic ; hp:name?name ; hp:blood?blood. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?species WHERE { hp:Gellert_grindelwald hp:species?species ; hp:name hp:Gellert_grindelwald.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:International_confederation_of_wizards hp:leader?leader. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?enemies  WHERE { hp:Wizengamot hp:name?name. hp:Wizengamot hp:enemies?enemies. hp:Wizengamot hp:headquarters hp:British_ministry_of_magic. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?blood_status WHERE {?minister a hp:Individual_ ; hp:title hp:Minister_for_magic ; hp:name?name ; hp:blood?blood_status. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?bloodStatus?boggart WHERE { hp:Cornelius_fudge hp:blood?bloodStatus ; hp:boggart?boggart. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?subscribers WHERE { hp:Transfiguration_today hp:subscribers?subscribers. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?ownerName WHERE { hp:Albus_dumbledores_wand hp:owners?owner.?owner hp:name?ownerName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemy WHERE { hp:International_confederation_of_wizards hp:enemies?enemy.}\n","------------------------------------------------------\n","SELECT?name?name WHERE { hp:Cornelius_fudges_wand hp:job?name.}\n","SELECT?name?enemies WHERE { hp:Improper_use_of_magic_office hp:name?name ; hp:enemies?enemies.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Educational_office hp:name?name ; hp:affiliation hp:International_confederation_of_wizards, hp:Wizardkind.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?boggart WHERE { hp:Cornelius_fudge hp:boggart?boggart.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?subscribers WHERE { hp:Transfiguration_today hp:subscribers?subscribers.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?source_url WHERE {hp:Pure_blood hp:source_url?source_url.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?person hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry, hp:Order_of_the_phoenix ; hp:name?name.?person a hp:Individual_. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?bgcolor WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:bgcolor?bgcolor.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?gender WHERE {?chief_warlock hp:name?name ; hp:gender?gender ; hp:job hp:Chief_warlock, hp:Wizengamot.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organizationName WHERE { hp:Educational_office hp:name?organizationName ; hp:leader hp:International_confederation_of_wizards ; hp:affiliation hp:Wizardkind.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romanceName WHERE { hp:Gellert_grindelwald hp:romances hp:Albus_dumbledore. hp:Gellert_grindelwald hp:name?romanceName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?founder WHERE { hp:Dumbledores_army hp:founder?founder. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?grindelwaldGender?edgecombeFatherGender WHERE { hp:Gellert_grindelwald hp:gender?grindelwaldGender. hp:Marietta_edgecombes_father hp:gender?edgecombeFatherGender.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemy WHERE { hp:International_confederation_of_wizards hp:enemies?enemy.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?minister_name WHERE {?minister a hp:Individual_ ; hp:title hp:Minister_for_magic ; hp:name?minister_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?member WHERE { hp:Edgecombe_family hp:members?member ; hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?owner WHERE { hp:Cornelius_fudges_wand hp:owners?owner.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE {?individual hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry, hp:Order_of_merlin. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT DISTINCT?org1?org2?enemy WHERE {?org1 hp:enemies?enemy.?org2 hp:enemies?enemy. FILTER(?org1!=?org2) }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?loyalty WHERE { hp:Hermione_granger hp:loyalty?loyalty. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?bloodStatus?house WHERE { hp:Edgecombe_family hp:blood?bloodStatus. hp:Edgecombe_family hp:house?house.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?residents  WHERE { hp:Mould_on_the_wold hp:residents?residents. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?individuals WHERE {?individuals hp:title hp:Minister_for_magic.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?org a hp:Organisation_ ; hp:name?name ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?bgcolor?intentions WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:bgcolor?bgcolor. hp:Department_of_magical_accidents_and_catastrophes hp:intentions?intentions.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?minister hp:title hp:Minister_for_magic.?minister hp:name?name.?minister hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organisation WHERE {?organisation hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry. FILTER (?organisation!= hp:Hogwarts_school_of_witchcraft_and_wizardry)}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?minister_name WHERE {?minister hp:job hp:Minister_for_magic ; hp:name?minister_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?nationality WHERE { hp:Cornelius_fudge hp:nationality?nationality. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT DISTINCT?memberName WHERE { hp:Edgecombe_family hp:members?member.?member hp:house hp:Ravenclaw ; hp:name?memberName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Wizengamot hp:leader hp:Albus_dumbledore ; hp:enemies hp:Order_of_the_phoenix ; hp:headquarters hp:British_ministry_of_magic ; hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?individual hp:boggart hp:Tom_riddle.?individual hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individualName WHERE {?individual hp:loyalty hp:Albus_dumbledore.?individual hp:name?individualName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?person hp:loyalty hp:British_ministry_of_magic, hp:Gryffindor ; hp:name?name.?person a hp:Individual_. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?job_title WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?name ; hp:title?job_title.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?affiliation WHERE { hp:Educational_office hp:name?name. hp:Educational_office hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?house WHERE { hp:Edgecombe_family hp:house?house.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romances WHERE { hp:Gellert_grindelwald hp:romances?romances. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?professor WHERE { hp:Defence_against_the_dark_arts hp:professor?professor. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?hogwarts_house WHERE { hp:Hermione_granger hp:house?hogwarts_house.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Improper_use_of_magic_office hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?orgName?headquarters WHERE {?org a hp:Organisation_ ; hp:name?orgName ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps ; hp:headquarters?headquarters.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?wandName?masters WHERE { hp:Cornelius_fudges_wand hp:name?wandName ; hp:masters?masters. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?gender WHERE { hp:Gellert_grindelwald hp:gender?gender.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?locationName WHERE { hp:Dumbledores_army hp:headquarters?location.?location hp:name?locationName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location WHERE { hp:Whitehall hp:location?location. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name  WHERE { hp:Albus_dumbledores_wand hp:owners?owners.?owners hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?intention WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:intentions?intention.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?house (GROUP_CONCAT(?name; separator=\", \") AS?names) WHERE {?individual hp:house?house ; hp:name?name. } GROUP BY?house ORDER BY DESC(COUNT(?individual)) LIMIT 1\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?member_name WHERE { hp:Edgecombe_family hp:members?member.?member hp:name?member_name ; hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?office_location?headquarters_location WHERE { hp:Minister_for_magics_office hp:location?office_location. hp:British_ministry_of_magic_headquarters hp:location?headquarters_location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Wizengamot hp:leader hp:Albus_dumbledore ; hp:name?name ; hp:enemies hp:Order_of_the_phoenix.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?gender WHERE { hp:Hector_fawley hp:gender?gender ; hp:name hp:Hector_fawley.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?wife WHERE { hp:Marietta_edgecombes_father hp:wife?wife.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?affiliation WHERE { hp:Dumbledores_army hp:enemies hp:British_ministry_of_magic ; hp:name?name ; hp:affiliation?affiliation. } \n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name WHERE { hp:Council_of_magical_law hp:name?name. hp:Council_of_magical_law hp:affiliation hp:British_ministry_of_magic. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?wand_name WHERE { hp:Cornelius_fudges_wand hp:name?wand_name.}\n","------------------------------------------------------\n"]}]},{"cell_type":"code","source":["train = Dataset(X_train)\n","count = 0\n","for index in range(len(train)):\n","  device = 'cuda'\n","  preds = model.generate(input_ids = torch.tensor(train[index][\"input_ids\"]).to(device).view(1,-1))\n","  print(tokenizer.decode(np.array(preds.cpu()[0]))[7:-4])\n","  print(tokenizer.decode(np.array(train[index][\"labels\"]))[3:-4])\n","  print('------------------------------------------------------')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"hcMKTpz7X1oO","executionInfo":{"status":"ok","timestamp":1680298140811,"user_tz":240,"elapsed":54638,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"57efe801-97f2-45b4-9a1e-58a5c7965aab"},"execution_count":57,"outputs":[{"output_type":"stream","name":"stdout","text":["SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?affiliation?intention WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:affiliation?affiliation. hp:Department_of_magical_accidents_and_catastrophes hp:intentions?intention.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?leader WHERE { hp:Educational_office hp:leader?leader.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?member WHERE { hp:Edgecombe_family hp:members?member.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?individualName WHERE { hp:Edgecombe_family hp:loyalty?loyalty ; hp:name hp:Edgecombe_family.?individual hp:loyalty?loyalty ; hp:name?individualName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?minister hp:title hp:Minister_for_magic.?minister hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:Wizengamot hp:leader?leader. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Council_of_magical_law hp:affiliation hp:British_ministry_of_magic ; hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?advisor WHERE {?advisor hp:gender hp:Male.?advisor hp:job hp:Advisor_to_the_minister_for_magic.}\n","------------------------------------------------------\n","SELECT?leader WHERE { hp:Hermione_granger hp:leader?leader.}\n","SELECT?organization?position WHERE { hp:Hermione_granger hp:job?position.?organization hp:leader hp:Hermione_granger. FILTER(?organization!= hp:Hermione_granger) }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?individual WHERE {?individual hp:loyalty hp:British_ministry_of_magic.?individual hp:loyalty hp:Order_of_the_phoenix.?individual hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister WHERE { hp:Hector_fawley hp:title?title.?minister hp:title?title. FILTER(?minister!= hp:Hector_fawley) }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?blood_status WHERE { hp:Edgecombe_family hp:members?edgecombe_member ; hp:blood?blood_status.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?job WHERE { hp:Harry_potter hp:job?job. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?source_url WHERE { hp:Stylish_wizard_of_the_year hp:source_url?source_url.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?professorName WHERE { hp:Defence_against_the_dark_arts hp:professor?professor.?professor hp:name?professorName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:Ministry_of_magic hp:leader?leader.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organization_name WHERE {?organization hp:leader hp:Albus_dumbledore ; hp:name?organization_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?job?loyalty WHERE { hp:Hermione_granger hp:job?job ; hp:loyalty?loyalty.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Mould_on_the_wold hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?blood WHERE { hp:Gellert_grindelwald hp:blood?blood. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?ministerName?officeName WHERE { hp:Minister_for_magics_office hp:name?officeName.?minister hp:job hp:Minister_for_magic ; hp:name?ministerName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?leader?affiliation WHERE { hp:Educational_office hp:name?name ; hp:leader?leader ; hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Council_of_magical_law hp:name?name ; hp:affiliation hp:British_ministry_of_magic.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romances WHERE { hp:Gellert_grindelwald hp:romances?romances. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?blood_status WHERE { hp:Queenie_goldstein hp:name?name ; hp:blood?blood_status.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name WHERE {?individual hp:affiliation hp:British_ministry_of_magic.?individual hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?individual hp:loyalty hp:Hogwarts_school_of_witchcraft_and_wizardry.?individual hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organizationName WHERE { hp:Dumbledores_army hp:founded hp:1997. hp:Dumbledores_army hp:founder hp:Harry_potter. hp:Dumbledores_army hp:intentions hp:Defence_against_the_dark_arts. hp:Dumbledores_army hp:name?organizationName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemy_name WHERE { hp:International_confederation_of_wizards hp:enemies?enemy.?enemy hp:name?enemy_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader?affiliation  WHERE { hp:Wizengamot hp:leader?leader. hp:Wizengamot hp:affiliation?affiliation. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?full_name WHERE { hp:Cornelius_fudge hp:name?full_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?residentName WHERE { hp:Mould_on_the_wold hp:residents?resident.?resident hp:name?residentName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location WHERE { hp:Whitehall hp:location?location. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?daughter WHERE { hp:Marietta_edgecombes_father hp:daughter?daughter.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?affiliation WHERE { hp:Edgecombe_family hp:loyalty?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location  WHERE { hp:Hogwarts_castle hp:location?location. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?enemies WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:enemies?enemies. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romances WHERE { hp:Gellert_grindelwald hp:romances?romances. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?gender WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?name ; hp:gender?gender. hp:Chief_warlock_of_the_wizengamot_in_1544 a hp:Individual_. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location WHERE { hp:Hogwarts_school_of_witchcraft_and_wizardry hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?residents WHERE { hp:Mould_on_the_wold hp:residents?residents.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?ownerName WHERE { hp:Elder_wand hp:owners?owner.?owner hp:name?ownerName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?skin_color WHERE { hp:Cornelius_fudge hp:skin?skin_color.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Transfiguration_today hp:name?name ; hp:subscribers hp:Albus_dumbledore.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?member WHERE { hp:Edgecombe_family hp:members?member.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?organization WHERE {?organization hp:headquarters hp:British_ministry_of_magic. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?ownerName WHERE { hp:Elder_wand hp:owners?owner.?owner hp:name?ownerName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?sourceUrl WHERE { hp:Order_of_merlin hp:source_url?sourceUrl.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation WHERE { hp:Astronomy_tower hp:affiliation?affiliation. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?house_name WHERE { hp:Ravenclaw hp:name?house_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?distinction WHERE { hp:Phoenix hp:distinction?distinction. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?org hp:bgcolor hp:9966cc, hp:C9a0dc.?org hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE { hp:Cornelius_fudge rdf:type hp:Individual_.?individual rdf:type hp:Individual_. FILTER(?individual = hp:Cornelius_fudge)}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation WHERE { hp:Minister_for_magics_office hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organization_name WHERE {?organization hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name?organization_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?individual WHERE {?individual hp:loyalty hp:Order_of_the_phoenix ; a hp:Individual_.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?owner_name WHERE { hp:Elder_wand hp:owners?owner.?owner hp:name?owner_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leaderName?enemyName WHERE { hp:Wizengamot hp:leader?leader.?leader hp:name?leaderName. hp:Wizengamot hp:enemies?enemy.?enemy hp:name?enemyName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?affiliation WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organizationName WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name?organizationName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?orgName WHERE {?org a hp:Organisation_ ; hp:name?orgName ; hp:enemies hp:Death_eaters, hp:Order_of_the_phoenix, hp:Tom_riddle.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?fatherName WHERE { hp:Marietta_edgecombes_father hp:name?fatherName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organizationName WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name?organizationName ; hp:headquarters hp:British_ministry_of_magic ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?location WHERE { hp:Minister_for_magics_office hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romances WHERE { hp:Gellert_grindelwald hp:romances?romances. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?resident WHERE { hp:London hp:residents?resident. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister WHERE {?minister hp:title hp:Minister_for_magic ; hp:job hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic ; hp:species hp:Human. FILTER (?minister!= hp:Cornelius_fudge)}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?jobTitle?loyalty WHERE { hp:Hermione_granger hp:title?jobTitle ; hp:loyalty?loyalty. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romances WHERE { hp:Gellert_grindelwald hp:romances?romances. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?founder?intentions  WHERE { hp:Dumbledores_army hp:founder?founder. hp:Dumbledores_army hp:intentions?intentions. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?blood_status WHERE { hp:Gellert_grindelwald hp:blood?blood_status.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?subscriberName WHERE { hp:Transfiguration_today hp:subscribers?subscriber.?subscriber hp:name?subscriberName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Astronomy_tower hp:location?location.?location hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individualName WHERE {?individual hp:job hp:Minister_for_magic.?individual hp:blood hp:Half_blood, hp:Pure_blood.?individual hp:name?individualName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?organization hp:name?name ; hp:affiliation hp:International_confederation_of_wizards.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?individual hp:job hp:Department_of_magical_law_enforcement.?individual hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation WHERE { hp:Hogwarts_castle hp:affiliation?affiliation. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individualName WHERE { hp:Peeves hp:loyalty?loyaltyTo.?loyaltyTo hp:name?individualName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?gender WHERE { hp:Cornelius_fudge hp:gender?gender. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?wand_owner WHERE { hp:Cornelius_fudges_wand hp:owners?wand_owner.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?sourceUrl WHERE { hp:Pure_blood hp:source_url?sourceUrl.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?intentions?founder WHERE { hp:Dumbledores_army hp:intentions?intentions. hp:Dumbledores_army hp:founder?founder. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?loyalty WHERE { hp:Edgecombe_family hp:loyalty?loyalty. OPTIONAL {?member hp:loyalty?loyalty. FILTER(?member IN (hp:Marietta_edgecombe, hp:Marietta_edgecombes_father, hp:Marietta_edgecombes_mother))}}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Hogwarts_castle hp:location hp:Scotland ; hp:name?name ; hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?owners  WHERE { hp:Elder_wand hp:owners?owners. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?locationName WHERE { hp:Astronomy_tower hp:location?location.?location hp:name?locationName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?individual WHERE {?individual hp:title hp:Minister_for_magic. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Mould_on_the_wold hp:location?location.?location hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation WHERE { hp:Phoenix hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?org (COUNT(?enemy) AS?enemyCount) WHERE {?org hp:enemies?enemy. } GROUP BY?org ORDER BY DESC(?enemyCount) LIMIT 1\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name?blood_status WHERE {?minister a hp:Individual_ ; hp:name?name ; hp:blood?blood_status ; hp:job hp:Minister_for_magic ; hp:born hp:Great_britain ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?office_name WHERE { hp:Hermione_granger hp:title?title.?title hp:name?office_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE {?individual hp:job hp:Minister_for_magic.?individual hp:house hp:Gryffindor. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location WHERE { hp:Astronomy_tower hp:location?location. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE {?individual hp:house hp:Hufflepuff.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister WHERE {?minister hp:title hp:Minister_for_magic ; hp:job hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:species hp:Human.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?minister hp:title hp:Minister_for_magic.?minister hp:patronus hp:Non_corporeal.?minister hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?owner WHERE { hp:Elder_wand hp:owners?owner. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?madeBy WHERE { hp:Cornelius_fudges_wand hp:name?name ; hp:made?madeBy.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?blood_status?species WHERE { hp:Queenie_goldstein hp:blood?blood_status. hp:Queenie_goldstein hp:species?species.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?gender WHERE { hp:Peeves hp:gender?gender.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?individual WHERE {?individual hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?schoolName WHERE { hp:Astronomy_tower hp:location?location.?location hp:name?schoolName. FILTER(CONTAINS(str(?location), 'Hogwarts'))}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location WHERE { hp:London hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Albus_dumbledores_wand hp:owners?owner.?owner hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?gender?bloodStatus WHERE { hp:Pius_thicknesse hp:gender?gender ; hp:blood?bloodStatus.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?bloodStatus WHERE { hp:Queenie_goldstein hp:blood?bloodStatus.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?location?resident WHERE { hp:London hp:location?location. OPTIONAL {?location hp:residents?resident.}}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Dumbledores_army hp:founder hp:Harry_potter. hp:Dumbledores_army hp:founded hp:1997. hp:Dumbledores_army hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual WHERE {?individual hp:boggart hp:Tom_riddle. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:International_confederation_of_wizards hp:leader?leader.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?romanceName WHERE { hp:Gellert_grindelwald hp:romances?romance.?romance hp:name?romanceName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?affiliation?location WHERE { hp:British_ministry_of_magic_headquarters hp:affiliation?affiliation. hp:British_ministry_of_magic_headquarters hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?job?loyalty WHERE { hp:Harry_potter hp:job?job. hp:Harry_potter hp:loyalty?loyalty. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?name?member?status WHERE { hp:Edgecombe_family hp:name?name ; hp:members?member ; hp:status?status.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister_name WHERE {?minister hp:blood hp:Half_blood, hp:Pure_blood ; hp:boggart hp:Tom_riddle ; hp:title hp:Minister_for_magic ; hp:name?minister_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader?affiliation?enemies WHERE { hp:Wizengamot hp:leader?leader. hp:Wizengamot hp:affiliation?affiliation. hp:Wizengamot hp:enemies?enemies. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?towerName WHERE { hp:Astronomy_tower hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry. hp:Astronomy_tower hp:name?towerName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name WHERE { hp:Wizengamot hp:name?name ; hp:headquarters hp:British_ministry_of_magic.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?blood WHERE { hp:Pius_thicknesse hp:blood?blood.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT DISTINCT?org1?org2 WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:enemies?enemy.?org1 hp:enemies?enemy.?org2 hp:enemies?enemy. FILTER(?org1!=?org2) }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?professor WHERE { hp:Defence_against_the_dark_arts hp:professor?professor.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?location?affiliation WHERE { hp:Whitehall hp:name?name ; hp:location?location ; hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?individual a hp:Individual_ ; hp:blood?blood_status ; hp:loyalty hp:British_ministry_of_magic, hp:Death_eaters ; hp:name?name. { SELECT?blood_status WHERE { hp:Pius_thicknesse hp:blood?blood_status.}}}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?headquarters WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name?name ; hp:headquarters?headquarters.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?residents WHERE { hp:Mould_on_the_wold hp:residents?residents. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organization WHERE { hp:Hermione_granger hp:loyalty?organization. FILTER (?organization!= hp:British_ministry_of_magic)}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemyName WHERE { hp:Wizengamot hp:enemies?enemy.?enemy hp:name?enemyName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Council_of_magical_law hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?member_name WHERE { hp:Edgecombe_family hp:members?member.?member hp:name?member_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Defence_against_the_dark_arts hp:name?name. hp:Dumbledores_army hp:intentions hp:Defence_against_the_dark_arts. hp:Dumbledores_army hp:headquarters hp:Hogwarts_school_of_witchcraft_and_wizardry. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT DISTINCT?ministerName WHERE {?minister hp:affiliation hp:British_ministry_of_magic ; hp:name?ministerName.?icw hp:enemies hp:Gellert_grindelwald. FILTER NOT EXISTS {?minister hp:loyalty?loyalty. FILTER (?loyalty!= hp:British_ministry_of_magic)} FILTER NOT EXISTS {?minister hp:enemies hp:Gellert_grindelwald. }}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:Prefect hp:leader hp:Head_boy_or_girl ; hp:name?leader.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?job WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?name. hp:Chief_warlock_of_the_wizengamot_in_1544 hp:job?job. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {hp:Cornelius_fudges_wand hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Improper_use_of_magic_office hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?fawleyJob WHERE { hp:Hector_fawley hp:job?fawleyJob.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?blood WHERE { hp:Cornelius_fudge hp:blood?blood.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemy WHERE { hp:International_confederation_of_wizards hp:enemies?enemy.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?wand_name WHERE {hp:Cornelius_fudges_wand hp:name?wand_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Dumbledores_army hp:name?name ; hp:founded hp:1997 ; hp:intentions hp:Defence_against_the_dark_arts.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?source_url WHERE { hp:Cornelius_fudges_wand hp:source_url?source_url.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister WHERE {?minister hp:gender hp:Male ; hp:job hp:Minister_for_magic.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?individualName WHERE {?individual hp:gender hp:Male ; hp:job hp:Minister_for_magic ; hp:name?individualName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name WHERE {?person hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?location WHERE { hp:Minister_for_magics_office hp:name?name ; hp:location?location.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?owner WHERE { hp:Elder_wand hp:owners?owner.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organizationName WHERE { hp:Hermione_granger hp:job?jobTitle.?jobTitle hp:name?organizationName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:International_confederation_of_wizards hp:leader?leader. FILTER (CONTAINS(str(?leader), 'Supreme_mugwump'))}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?member WHERE { hp:Edgecombe_family hp:members?member.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?locationName WHERE { hp:Astronomy_tower hp:location?location.?location hp:name?locationName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?org_name WHERE {?org a hp:Organisation_ ; hp:affiliation hp:British_ministry_of_magic ; hp:affiliation hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name?org_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Minister_for_magic hp:name?name.}\n","SELECT?name?affiliation WHERE { hp:Minister_for_magics_office hp:name?name. hp:Minister_for_magics_office hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?familyName?bloodStatus WHERE { hp:Edgecombe_family hp:name?familyName. hp:Edgecombe_family hp:blood?bloodStatus.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?made WHERE { hp:Cornelius_fudges_wand hp:name?name ;hp:made?made.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE {?house hp:name?name. FILTER regex(str(?house), \"Hogwarts\") }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?individualName WHERE {?individual hp:born hp:Great_britain.?individual hp:job hp:Minister_for_magic.?individual hp:name?individualName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individual?blood WHERE {?individual a hp:Individual_ ; hp:blood?blood. FILTER (?individual IN (hp:Cornelius_fudge, hp:Pius_thicknesse)) }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?individualName  WHERE {?individual hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry.?individual hp:name?individualName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation WHERE {hp:Improper_use_of_magic_office hp:affiliation?affiliation.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?blood_status WHERE { hp:Hermione_granger hp:blood?blood_status.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?member?house WHERE { hp:Edgecombe_family hp:members?member.?member hp:house?house.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?species WHERE { hp:Queenie_goldstein hp:name?name ; hp:species?species.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemy_organization WHERE { hp:Improper_use_of_magic_office hp:enemies?enemy_organization.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individualName WHERE {?individual hp:patronus hp:Non_corporeal.?individual hp:name?individualName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?order_source?advisor_source WHERE { hp:Order_of_merlin hp:source_url?order_source. hp:Advisor_to_the_minister_for_magic hp:source_url?advisor_source.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?nephew WHERE { hp:Cornelius_fudges_wife hp:nephew?nephew.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?job WHERE { hp:Millicent_bagnold hp:job?job.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?chief_warlock_name WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?chief_warlock_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemy?headquarters WHERE { hp:Wizengamot hp:enemies?enemy ; hp:headquarters?headquarters.} \n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?founder?leader WHERE { hp:Dumbledores_army hp:founder?founder ; hp:leader?leader. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:Prefect hp:leader hp:Head_boy_or_girl ; hp:name?leader.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location?residents WHERE { hp:Mould_on_the_wold hp:location?location. hp:Mould_on_the_wold hp:residents?residents. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?ownerName WHERE { hp:Hogwarts_castle hp:owner?owner.?owner hp:name?ownerName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Ravenclaw hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?individualName WHERE {?individual hp:boggart hp:Tom_riddle.?individual hp:name?individualName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?enemyName  WHERE { hp:International_confederation_of_wizards hp:enemies?enemy.?enemy hp:name?enemyName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?owner WHERE { hp:Hogwarts_castle hp:owner?owner. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?ministerName WHERE {?minister a hp:Individual_.?minister hp:title hp:Minister_for_magic.?minister hp:name?ministerName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?placeName WHERE { hp:Mould_on_the_wold hp:location?location.?location hp:name?placeName. FILTER(CONTAINS(str(?location), 'Great_britain'))}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister_name WHERE {?minister hp:job hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry ; hp:name?minister_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?owner WHERE { hp:Elder_wand hp:owners?owner. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:International_confederation_of_wizards hp:enemies?enemy.?enemy hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name WHERE {?person hp:loyalty hp:British_ministry_of_magic, hp:Death_eaters ; hp:name?name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name WHERE { hp:Educational_office hp:name?name ; hp:affiliation hp:International_confederation_of_wizards.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?gender WHERE { hp:Chief_warlock_of_the_wizengamot_in_1544 hp:name?name ; hp:gender?gender.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Wizengamot hp:name?name.}\n","SELECT?status WHERE { hp:Edgecombe_family hp:status?status. } \n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation WHERE { hp:Hogwarts_castle hp:affiliation?affiliation. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?affiliation?distinction WHERE { hp:Phoenix hp:affiliation?affiliation ; hp:distinction?distinction.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?blood_status WHERE {?minister a hp:Individual_ ; hp:name?name ; hp:blood?blood_status ; hp:job hp:Minister_for_magic ; hp:boggart hp:Tom_riddle.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?location_name WHERE { hp:Hogwarts_castle hp:location?location ; hp:name?location_name. FILTER (strstarts(str(?location), str(hp:Great_britain)))}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?intentions WHERE { hp:Department_of_magical_accidents_and_catastrophes hp:name?name ;hp:intentions?intentions.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leader WHERE { hp:Wizengamot hp:leader?leader. hp:Wizengamot hp:enemies hp:Order_of_the_phoenix. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?prefectName WHERE { hp:Prefect hp:affiliation hp:Gryffindor. hp:Prefect hp:leader hp:Head_boy_or_girl. hp:Prefect hp:name?prefectName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?resident WHERE { hp:Mould_on_the_wold hp:residents?resident. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?house?job WHERE { hp:Hermione_granger hp:house?house ; hp:title?job.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?orgName  WHERE {  hp:Department_of_magical_accidents_and_catastrophes hp:name?orgName ; hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister WHERE {?minister hp:job hp:Minister_for_magic ; hp:title hp:Minister_for_magic ; hp:loyalty hp:British_ministry_of_magic, hp:Hogwarts_school_of_witchcraft_and_wizardry.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?leaderName WHERE { hp:Wizengamot hp:leader hp:Albus_dumbledore. hp:Albus_dumbledore hp:name?leaderName. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?wandName WHERE { hp:Albus_dumbledores_wand hp:name?wandName.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?job WHERE { hp:Hermione_granger hp:job?job. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?minister_name WHERE {?minister hp:job hp:Minister_for_magic ; hp:blood hp:Pure_blood ; hp:name?minister_name.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?name?gender WHERE {?individual hp:job hp:Chief_warlock ; hp:title hp:Chief_warlock.?individual hp:name?name.?individual hp:gender?gender.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:British_ministry_of_magic hp:name?name.}\n","SELECT?name WHERE {?org hp:affiliation hp:British_ministry_of_magic ; hp:name?name. }\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?source_url WHERE { hp:Order_of_merlin hp:source_url?source_url.}\n","------------------------------------------------------\n","SELECT?name WHERE { hp:Cornelius_fudges_wand hp:name?name.}\n","SELECT?organization WHERE {?organization hp:intentions hp:Reverting_the_consequences_of_major_magical_mishaps.?organization hp:enemies hp:Death_eaters, hp:Order_of_the_phoenix.}\n","------------------------------------------------------\n"]}]},{"cell_type":"code","source":["preds.cpu()[0]"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"h86J1xCBUJ-O","executionInfo":{"status":"ok","timestamp":1680293835197,"user_tz":240,"elapsed":156,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"71ce92c8-c1ce-49b2-e1c3-ce8d91a2dfe3"},"execution_count":42,"outputs":[{"output_type":"execute_result","data":{"text/plain":["tensor([    2,     0, 49179, 17487,   605,   463,  1215, 13650, 29919, 25522,\n","        29886,    35, 43078,   523,  6125,  1215,   506,  1906,  5641,     2])"]},"metadata":{},"execution_count":42}]},{"cell_type":"code","source":["tokenizer.decode(np.array(preds.cpu()[0]))[7:-4]"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":35},"id":"G1aNCeh8Tgqk","executionInfo":{"status":"ok","timestamp":1680293888694,"user_tz":240,"elapsed":173,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"643a5393-cd19-434b-c03b-3766af2b27ae"},"execution_count":43,"outputs":[{"output_type":"execute_result","data":{"text/plain":["'</s><s>SELECT?wand_name WHERE { hp:Cornelius_fudges</s>'"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"}},"metadata":{},"execution_count":43}]},{"cell_type":"code","source":["tokenizer.decode(np.array(test[index][\"labels\"]))[3:-4]"],"metadata":{"colab":{"base_uri":"https://localhost:8080/","height":35},"id":"C4ASYuzyVGim","executionInfo":{"status":"ok","timestamp":1680294050005,"user_tz":240,"elapsed":154,"user":{"displayName":"Zidu Yin","userId":"08478661775872863994"}},"outputId":"3af8b95d-6943-4707-d51e-c5aff33b3531"},"execution_count":44,"outputs":[{"output_type":"execute_result","data":{"text/plain":["'<s>SELECT?wand_name WHERE { hp:Cornelius_fudges_wand hp:name?wand_name.}</s>'"],"application/vnd.google.colaboratory.intrinsic+json":{"type":"string"}},"metadata":{},"execution_count":44}]}]}