[
    {
        "question": "Who is the Minister for Magic during Hector Fawley's term?",
        "SPQRQL": "SELECT ?minister WHERE { hp:Hector_fawley hp:title 'Minister_for_magic' . hp:Ministry_of_magic hp:leader ?minister .}"
    },
    {
        "question": "What is the location of the Edgecombe family?",
        "SPQRQL": "SELECT ?locationName WHERE { hp:Edgecombe_family hp:location ?locationName .}"
    },
    {
        "question": "Which organisations does Cornelius Fudge have loyalty to?",
        "SPQRQL": "SELECT ?organisationName WHERE { hp:Cornelius_fudge hp:loyalty ?organisation ; hp:name hp:Cornelius_fudge . ?organisation hp:name ?organisationName .}"
    },
    {
        "question": "What is the affiliation of Millicent Bagnold?",
        "SPQRQL": "SELECT ?affiliationName WHERE { hp:Millicent_bagnold hp:affiliation ?affiliation ; hp:name hp:Millicent_bagnold . ?affiliation hp:name ?affiliationName .}"
    },
    {
        "question": "What are the names and birth dates of all the female Nobel laureates in physics?",
        "SPQRQL": "SELECT ?name ?birthdate WHERE { ?person a dbo:NobelPrizeWinner ; dbo:nobelPrizeFor dbr:Physics ;dbo:gender \"female\"@en ; dbo:birthDate ?birthdate ; foaf:name ?name .}"
    },
    {
        "question": "What is the affiliation of the International Confederation of Wizards?",
        "SPQRQL": "SELECT ?affiliation WHERE { hp:International_confederation_of_wizards hp:affiliation ?affiliation . }"
    },
    {
        "question": "What are the names of all individuals who have served as Minister for Magic and belong to a wizarding family of unknown degree?",
        "SPQRQL": "SELECT DISTINCT ?ministerName WHERE { ?minister hp:title hp:Minister_for_magic ; hp:job hp:Minister_for_magic ; hp:blood hp:Wizarding_family_of_unknown_degree . }"
    },
    {
        "question": "Who are the individuals who have a patronus that is non-corporeal and have served as Minister for Magic?",
        "SPQRQL": "SELECT DISTINCT ?ministerName WHERE { ?minister hp:title hp:Minister_for_magic ; hp:patronus hp:Non_corporeal ; hp:species hp:Human .}"
    },
    {
        "question": "What are the names of all individuals who are not human and have served as Minister for Magic?",
        "SPQRQL": "SELECT DISTINCT ?ministerName WHERE { ?minister hp:title hp:Minister_for_magic ; hp:species ?species . FILTER (?species != hp:Human) ?minister hp:name ?ministerName . }"
    },
    {
        "question": "What is the gender and location of Gellert Grindelwald?",
        "SPQRQL": "SELECT ?gender ?location WHERE { hp:Gellert_grindelwald hp:gender ?gender ; hp:location ?location .}"
    },
    {
        "question": "What is the nationality of Hector Fawley?",
        "SPQRQL": "SELECT ?nationality WHERE { hp:Hector_fawley hp:nationality ?nationality . }"
    },
    {
        "question": "Who are the individuals that have the job title of Minister for Magic and have served as a leader of the Ministry of Magic?",
        "SPQRQL": "SELECT ?name WHERE { ?minister hp:title hp:Minister_for_magic . ?minister hp:job hp:Minister_for_magic . ?minister hp:leader ?minister . ?minister hp:name ?name .}"
    },
    {
        "question": "Who are the individuals with the job of Stylish Wizard of the Year?",
        "SPQRQL": "SELECT ?individual WHERE { ?individual hp:job hp:Stylish_wizard_of_the_year . }"
    }
]